/**
 * Copyright 2023-present DreamNum Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

export const Pt = [
    '12,1,104,03',
    '{"b":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"c":[{"h":0,"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1,"c":3}],"ç":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"d":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"f":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"g":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":[{"a":2,"e":2,"i":2,"o":2},1],"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"j":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"k":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"l":[{"h":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"m":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"n":[{"h":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"p":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"q":[{"u":[{"a":2,"e":2,"i":2,"o":2}]}],"r":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1,"r":3}],"s":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1,"s":3}],"t":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"v":[{"l":0,"r":0,"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"w":[{"l":0,"r":0}],"x":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"z":[{"a":1,"e":1,"i":1,"o":1,"u":1,"á":1,"â":1,"ã":1,"é":1,"í":1,"ó":1,"ú":1,"ê":1,"õ":1}],"a":[{"a":3,"e":3,"o":3}],"e":[{"a":3,"e":3,"o":3}],"i":[{"a":3,"e":3,"i":3,"o":3,"â":3,"ê":3,"ô":3}],"o":[{"a":3,"e":3,"o":3}],"u":[{"a":3,"e":3,"o":3,"u":3}],"-":1}',
    ['hard-ware', 'soft-ware'],
];
