/**
 * Copyright 2023-present DreamNum Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

import type enUS from './en-US';

const locale: typeof enUS = {
    BETADIST: {
        description: 'تُرجع دالة كثافة احتمال بيتا التراكمية. يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.',
        abstract: 'تُرجع دالة كثافة احتمال بيتا التراكمية. يتم بشكلٍ عام استخدام توزيع بيتا لدراسة التباين في النسبة المئوية لشيء ما عبر عينات، مثل فترات اليوم التي يقضيها الأشخاص في مشاهدة التلفزيون.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/betadist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. وهي القيمة بين A وB التي يتم تقييم الدالة عندها.' },
            alpha: { name: 'alpha', detail: 'مطلوب. وهي معلمة التوزيع.' },
            beta: { name: 'beta', detail: 'مطلوب. وهي معلمة التوزيع.' },
            A: { name: 'A', detail: 'وهي حد أدنى للفاصل الزمني x.' },
            B: { name: 'B', detail: 'اختياري. وهي حد أعلى للفاصل الزمني x.' },
        },
    },
    BETAINV: {
        description: 'تُرجع عكس دالة كثافة احتمال بيتا التراكمية لتوزيع بيتا معين. أي إذا كانت probability = BETADIST(x,...)‎، فعندئذٍ تكون BETAINV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.',
        abstract: 'تُرجع عكس دالة كثافة احتمال بيتا التراكمية لتوزيع بيتا معين. أي إذا كانت probability = BETADIST(x,...)‎، فعندئذٍ تكون BETAINV(probability,...) = x. يمكن استخدام توزيع بيتا في تخطيط المشاريع لتخطيط مواعيد الانتهاء المحتملة عند تعيين الوقت المتوقع للإنهاء وقابلية التغيير.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/betainv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. وهي الاحتمال المقترن بتوزيع بيتا.' },
            alpha: { name: 'alpha', detail: 'مطلوب. وهي معلمة التوزيع.' },
            beta: { name: 'beta', detail: 'مطلوب. وهي معلمة التوزيع.' },
            A: { name: 'A', detail: 'وهي حد أدنى للفاصل الزمني x.' },
            B: { name: 'B', detail: 'اختياري. وهي حد أعلى للفاصل الزمني x.' },
        },
    },
    BINOMDIST: {
        description: 'تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOMDIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOMDIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.',
        abstract: 'تُرجع المصطلح الفردي لاحتمال التوزيع ذي الحدين. استخدم BINOMDIST في المشاكل ذات العدد الثابت من الاختبارات أو التجارب، عندما تكون نتائج أي تجربة هي نجاح أو فشل فقط، وعندما تكون التجارب مستقلة، وعندما يكون احتمال النجاح ثابتاً في كافة مراحل التجربة. على سبيل المثال، بإمكان BINOMDIST حساب احتمال أن يكون اثنان من المواليد الثلاثة القادمين من الذكور.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/binomdist-function',
            },
        ],
        functionParameter: {
            numberS: { name: 'number_s', detail: 'مطلوب. وهي عدد مرات النجاح في التجارب.' },
            trials: { name: 'trials', detail: 'مطلوب. وهي عدد التجارب المستقلة.' },
            probabilityS: { name: 'probability_s', detail: 'مطلوب. وهي احتمال النجاح في كل تجربة.' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. وهي القيمة المنطقية التي تحدد شكل الدالة. إذا كانت قيمة cumulative تساوي TRUE، فإن BINOMDIST تُرجع دالة التوزيع التراكمي، وهي الاحتمال بوجود number_s لعدد مرات النجاح على الأكثر، وإذا كانت تساوي FALSE، فإنها تُرجع دالة الاحتمالات غير التراكمية، وهي الاحتمال بوجود number_s لعدد مرات النجاح بالضبط.' },
        },
    },
    CHIDIST: {
        description: 'تُرجع الاحتمال ذا الطرف الأيمن لتوزيع كاي التربيعي. يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.',
        abstract: 'تُرجع الاحتمال ذا الطرف الأيمن لتوزيع كاي التربيعي. يقترن توزيع χ2 باختبار χ2. استخدم اختبار χ2 لمقارنة القيم التي تمت ملاحظتها بالقيم المتوقعة. على سبيل المثال، قد تفترض إحدى التجارب الجينية أن الجيل التالي من النباتات سيحمل مجموعة معينة من الألوان. يمكنك تحديد ما إذا كانت فرضيتك الأصلية صحيحة من خلال مقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/chidist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها.' },
            degFreedom: { name: 'deg_freedom', detail: 'مطلوب. وهي عدد درجات الحرية.' },
        },
    },
    CHIINV: {
        description: 'تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي التربيعي. إذا كانت probability = CHIDIST(x,...)‎، فعندئذٍ تكون CHIINV(probability,...) = x. استخدم هذه الدالة لمقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة لتحديد ما إذا كانت فرضيتك الأصلية صحيحة.',
        abstract: 'تُرجع عكس الاحتمال ذي الطرف الأيمن لتوزيع كاي التربيعي. إذا كانت probability = CHIDIST(x,...)‎، فعندئذٍ تكون CHIINV(probability,...) = x. استخدم هذه الدالة لمقارنة النتائج التي تمت ملاحظتها بالنتائج المتوقعة لتحديد ما إذا كانت فرضيتك الأصلية صحيحة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/chiinv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. وهي احتمال مقترن بتوزيع كاي تربيع.' },
            degFreedom: { name: 'deg_freedom', detail: 'مطلوب. وهي عدد درجات الحرية.' },
        },
    },
    CHITEST: {
        description: 'تُرجع اختبار الاستقلال. تُرجع CHITEST القيمة من توزيع كاي تربيع (χ2) للإحصاء ودرجات الحرية المناسبة. ويمكنك استخدام اختبارات χ2 لتحديد ما إذا تم التحقق من صحة النتائج المفترضة بواسطة تجربة.',
        abstract: 'تُرجع اختبار الاستقلال. تُرجع CHITEST القيمة من توزيع كاي تربيع (χ2) للإحصاء ودرجات الحرية المناسبة. ويمكنك استخدام اختبارات χ2 لتحديد ما إذا تم التحقق من صحة النتائج المفترضة بواسطة تجربة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/chitest-function',
            },
        ],
        functionParameter: {
            actualRange: { name: 'actual_range', detail: 'مطلوب. وهي نطاق البيانات الذي يحتوي على الملاحظات التي تريد اختبارها مقابل القيم المتوقعة.' },
            expectedRange: { name: 'expected_range', detail: 'مطلوب. وهي نطاق البيانات الذي يحتوي على نسبة حاصل ضرب إجماليات الصفوف وإجماليات الأعمدة إلى الإجمالي الكلي.' },
        },
    },
    CONFIDENCE: {
        description: 'تُرجع فاصل الثقة لوسط محتوى باستخدام توزيع عادي.',
        abstract: 'تُرجع فاصل الثقة لوسط محتوى باستخدام توزيع عادي.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/confidence-function',
            },
        ],
        functionParameter: {
            alpha: { name: 'alpha', detail: 'مطلوب. مستوى الدلالة المُستخدم لحساب مستوى الثقة. يساوي مستوى الثقة ‎100*(1 - alpha)%‎، أو بعبارة أخرى، تشير alpha ذات القيمة 0,05 إلى مستوى ثقة بنسبة 95 في المئة.' },
            standardDev: { name: 'standard_dev', detail: 'مطلوب. الانحراف المعياري للمحتوى الخاص بنطاق البيانات والذي من المفترض أن يكون معروفاً.' },
            size: { name: 'size', detail: 'مطلوب. حجم العينة.' },
        },
    },
    COVAR: {
        description: 'إرجاع التباين المشترك، متوسط منتجات الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.',
        abstract: 'إرجاع التباين المشترك، متوسط منتجات الانحرافات لكل زوج من نقاط البيانات في مجموعتين من البيانات.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/covar-function',
            },
        ],
        functionParameter: {
            array1: { name: 'array1', detail: 'مطلوب. تمثل هذه الوسيطة نطاق الخلايا الأول من الأعداد الصحيحة.' },
            array2: { name: 'array2', detail: 'مطلوب. تمثل هذه الوسيطة نطاق الخلايا الثاني من الأعداد الصحيحة.' },
        },
    },
    CRITBINOM: {
        description: 'تُرجع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها. استخدم هذه الدالة مع تطبيقات تأكيد الجودة. على سبيل المثال، استخدم CRITBINOM لتحديد أكبر عدد من الأجزاء التالفة المسموح بفصلها عن خط تجميع من دون رفض الكمية بأكملها.',
        abstract: 'تُرجع أصغر قيمة يكون التوزيع التراكمي ذو الحدين الخاص بها أكبر من قيمة المعيار أو مساوياً لها. استخدم هذه الدالة مع تطبيقات تأكيد الجودة. على سبيل المثال، استخدم CRITBINOM لتحديد أكبر عدد من الأجزاء التالفة المسموح بفصلها عن خط تجميع من دون رفض الكمية بأكملها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/critbinom-function',
            },
        ],
        functionParameter: {
            trials: { name: 'trials', detail: 'مطلوب. وهي عدد تجارب Bernoulli.' },
            probabilityS: { name: 'probability_s', detail: 'مطلوب. وهي احتمال النجاح في كل تجربة.' },
            alpha: { name: 'alpha', detail: 'مطلوب. وهي قيمة المعيار.' },
        },
    },
    EXPONDIST: {
        description: 'تُرجع التوزيع الأسي. استخدم الدالة EXPONDIST لتنظيم الوقت بين الأحداث، مثل الوقت الذي يحتاجه صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام EXPONDIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة كحد أقصى.',
        abstract: 'تُرجع التوزيع الأسي. استخدم الدالة EXPONDIST لتنظيم الوقت بين الأحداث، مثل الوقت الذي يحتاجه صرّاف المصرف الآلي لتسليم النقود. على سبيل المثال، يمكنك استخدام EXPONDIST لتحديد احتمال أن تستغرق العملية دقيقة واحدة كحد أقصى.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/expondist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. قيمة الدالة.' },
            lambda: { name: 'lambda', detail: 'مطلوب. قيمة المعلمة.' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. قيمة منطقية تشير إلى تركيبة الدالة الأسية التي سيتم توفيرها. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع EXPONDIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال.' },
        },
    },
    FDIST: {
        description: 'تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.',
        abstract: 'تُرجع توزيع الاحتمال F (ذي الطرف الأيمن) (درجة الاختلاف) لمجموعتين من البيانات. يمكنك استخدام هذه الدالة لتحديد ما إذا كانت درجات الاختلاف بين مجموعتان من البيانات مختلفة. على سبيل المثال، يمكنك معاينة نقاط الاختبار التي حصل عليها شبّان وشابات في امتحان دخول مدرسة ثانوية وتحديد ما إذا كان الفرق بين نقاط الإناث مختلفاً عن الفرق بين نقاط الذكور.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/fdist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. القيمة التي يتم تقييم الدالة إليها.' },
            degFreedom1: { name: 'deg_freedom1', detail: 'مطلوب. بسط درجات الحرية.' },
            degFreedom2: { name: 'deg_freedom2', detail: 'مطلوب. مقام درجات الحرية.' },
        },
    },
    FINV: {
        description: 'تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت p = FDIST(x,...)‎، فتكون عندئذِ FINV(p,...) = x.',
        abstract: 'تُرجع هذه الدالة عكس توزيع الاحتمال F (ذي الطرف الأيمن). إذا كانت p = FDIST(x,...)‎، فتكون عندئذِ FINV(p,...) = x.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/finv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. احتمال مقترن بتوزيع F التراكمي.' },
            degFreedom1: { name: 'deg_freedom1', detail: 'مطلوب. بسط درجات الحرية.' },
            degFreedom2: { name: 'deg_freedom2', detail: 'مطلوب. مقام درجات الحرية.' },
        },
    },
    FTEST: {
        description: 'إرجاع نتيجة اختبار F. يقوم اختبار F بإرجاع الاحتمال ثنائي الطرف أن التباينات في array1 و array2 ليست مختلفة بشكل كبير. استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.',
        abstract: 'إرجاع نتيجة اختبار F. يقوم اختبار F بإرجاع الاحتمال ثنائي الطرف أن التباينات في array1 و array2 ليست مختلفة بشكل كبير. استخدم هذه الدالة لتحديد وجود تباينات مختلفة بين نموذجين. على سبيل المثال، بالاستناد إلى نقاط اختبار من مدرستين رسمية وخاصة، يمكنك اختبار ما إذا كانت مستويات التباين في نقاط الاختبار مختلفة بين هاتين المدرستين.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ftest-function',
            },
        ],
        functionParameter: {
            array1: { name: 'array1', detail: 'مطلوب. الصفيف أو نطاق البيانات الأول.' },
            array2: { name: 'array2', detail: 'مطلوب. الصفيف أو نطاق البيانات الثاني.' },
        },
    },
    GAMMADIST: {
        description: 'تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.',
        abstract: 'تُرجع توزيع غاما. يمكنك استخدام هذه الدالة لدراسة المتغيرات التي قد تكون ذات توزيع منحرف. يُستخدم توزيع غاما بشكل شائع في تحليل الصفوف.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/gammadist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. وهي القيمة التي تريد تقييم التوزيع عندها.' },
            alpha: { name: 'alpha', detail: 'مطلوب. معلمة للتوزيع.' },
            beta: { name: 'beta', detail: 'مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع الدالة GAMMADIST توزيع غاما القياسي.' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. القيمة المنطقية التي تحدد تركيبة الدالة. إذا تم تقييم Cumulative على أنها TRUE، فتُرجع الدالة GAMMADIST دالة التوزيع التراكمي؛ وإذا كانت قيمتها FALSE، فتُرجع دالة كثافة الاحتمال.' },
        },
    },
    GAMMAINV: {
        description: 'تُرجع عكس توزيع غاما التراكمي. إذا كانت قيمة p = GAMMADIST(x,...)‎، فتكون عندئذٍ GAMMAINV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون توزيعه منحرفاً.',
        abstract: 'تُرجع عكس توزيع غاما التراكمي. إذا كانت قيمة p = GAMMADIST(x,...)‎، فتكون عندئذٍ GAMMAINV(p,...) = x. يمكنك استخدام هذه الدالة لدراسة متغير قد يكون توزيعه منحرفاً.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/gammainv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. الاحتمال المقترن بتوزيع غاما.' },
            alpha: { name: 'alpha', detail: 'مطلوب. معلمة للتوزيع.' },
            beta: { name: 'beta', detail: 'مطلوب. معلمة للتوزيع. إذا كانت beta = 1، فتُرجع GAMMAINV توزيع غاما القياسي.' },
        },
    },
    HYPGEOMDIST: {
        description: 'تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOMDIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة ومرات النجاح في المحتوى وحجم المحتوى. استخدم HYPGEOMDIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.',
        abstract: 'تُرجع هذه الدالة توزيع الهندسة الفوقية. تُرجع الدالة HYPGEOMDIST احتمال عدد معين لمرات النجاح في العينة، بالنسبة إلى حجم العينة ومرات النجاح في المحتوى وحجم المحتوى. استخدم HYPGEOMDIST لحل المشاكل التي تتعلق بمحتوى محدود، حيث تكون كل عملية مراقبة عبارة عن نجاح أو فشل، وحيث يتم اختيار كل مجموعة فرعية ذات حجم معيّن باحتمالية متساوية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/hypgeomdist-function',
            },
        ],
        functionParameter: {
            sampleS: { name: 'sample_s', detail: 'مطلوب. عدد مرات النجاح في العينة.' },
            numberSample: { name: 'number_sample', detail: 'مطلوب. حجم العينة.' },
            populationS: { name: 'population_s', detail: 'مطلوب. عدد مرات النجاح في المحتوى.' },
            numberPop: { name: 'number_pop', detail: 'مطلوب. حجم المحتوى.' },
        },
    },
    LOGINV: {
        description: 'تُرجع هذه الدالة عكس دالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع ln(x)‎ بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. إذا كانت قيمة p = LOGNORMDIST(x,...)‎، فتكون عندئذٍ قيمة LOGINV(p) = x.',
        abstract: 'تُرجع هذه الدالة عكس دالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع ln(x)‎ بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. إذا كانت قيمة p = LOGNORMDIST(x,...)‎، فتكون عندئذٍ قيمة LOGINV(p) = x.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/loginv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. الاحتمال المقترن بالتوزيع اللوغاريتمي الطبيعي.' },
            mean: { name: 'mean', detail: 'مطلوب. وسط (ln(x.' },
            standardDev: { name: 'standard_dev', detail: 'مطلوب. الانحراف المعياري لـ (ln(x.' },
        },
    },
    LOGNORMDIST: {
        description: 'تُرجع هذه الدالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.',
        abstract: 'تُرجع هذه الدالة التوزيع اللوغاريتمي الطبيعي التراكمي لـ x، حيث يتم توزيع (ln(x بشكل طبيعي باستخدام المعلمتين mean وstandard_dev. استخدم هذه الدالة لتحليل البيانات التي تم تحويلها لوغاريتمياً.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/lognormdist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. القيمة التي يتم تقييم الدالة إليها.' },
            mean: { name: 'mean', detail: 'مطلوب. وسط (ln(x.' },
            standardDev: { name: 'standard_dev', detail: 'مطلوب. الانحراف المعياري لـ (ln(x.' },
        },
    },
    MODE: {
        description: 'لنفترض أنك تريد معرفة عدد أنواع الطيور الأكثر شيوعًا الذي تم رصده في عينة لعدد الطيور في أرض رطبة متدهورة على مدى فترة زمنية قدرها 30 عامًا، أو تريد معرفة عدد المكالمات الهاتفية الأكثر شيوعًا في مركز دعم عبر الهاتف خارج ساعات الذروة. لحساب وضع مجموعة من الأرقام، استخدم الدالة MODE .',
        abstract: 'لنفترض أنك تريد معرفة عدد أنواع الطيور الأكثر شيوعًا الذي تم رصده في عينة لعدد الطيور في أرض رطبة متدهورة على مدى فترة زمنية قدرها 30 عامًا، أو تريد معرفة عدد المكالمات الهاتفية الأكثر شيوعًا في مركز دعم عبر الهاتف خارج ساعات الذروة. لحساب وضع مجموعة من الأرقام، استخدم الدالة MODE .',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/mode-function',
            },
        ],
        functionParameter: {
            number1: { name: 'number1', detail: 'مطلوب. وسيطة الرقم الأول الذي تريد حساب الوضع الخاص به.' },
            number2: { name: 'number2', detail: 'الاختياري. وسيطات الأرقام من 2 حتى 255 التي تريد حساب الوضع الخاص بها. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل.' },
        },
    },
    NEGBINOMDIST: {
        description: 'تُرجع هذه الدالة التوزيع السالب ذا الحدين. تُرجع الدالة NEGBINOMDIST احتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، عندما يكون الاحتمال الثابت للنجاح probability_s. تشبه هذه الدالة التوزيع ذا الحدين، باستثناء أن عدد النجاحات ثابت وعدد التجارب متغير. من المفترض أن تكون التجارب مستقلة، مثل التوزيع ذي الحدين.',
        abstract: 'تُرجع هذه الدالة التوزيع السالب ذا الحدين. تُرجع الدالة NEGBINOMDIST احتمال وجود مرات فشل عددها number_f قبل النجاح رقم number_s، عندما يكون الاحتمال الثابت للنجاح probability_s. تشبه هذه الدالة التوزيع ذا الحدين، باستثناء أن عدد النجاحات ثابت وعدد التجارب متغير. من المفترض أن تكون التجارب مستقلة، مثل التوزيع ذي الحدين.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/negbinomdist-function',
            },
        ],
        functionParameter: {
            numberF: { name: 'number_f', detail: 'مطلوب. عدد مرات الفشل.' },
            numberS: { name: 'number_s', detail: 'مطلوب. عتبة محاولات النجاح.' },
            probabilityS: { name: 'probability_s', detail: 'مطلوب. احتمال النجاح.' },
        },
    },
    NORMDIST: {
        description: 'ترجع الدالة NORMDIST التوزيع العادي للمتوسط المحدد والانحراف المعياري. تحتوي هذه الدالة على مجموعة واسعة من التطبيقات في الإحصائيات، بما في ذلك اختبار الفرضية.',
        abstract: 'ترجع الدالة NORMDIST التوزيع العادي للمتوسط المحدد والانحراف المعياري. تحتوي هذه الدالة على مجموعة واسعة من التطبيقات في الإحصائيات، بما في ذلك اختبار الفرضية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/normdist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. القيمة التي تريد التوزيع لها' },
            mean: { name: 'mean', detail: 'مطلوب. الوسط الحسابي للتوزيع' },
            standardDev: { name: 'standard_dev', detail: 'مطلوب. الانحراف المعياري للتوزيع' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. القيمة المنطقية التي تحدد شكل الدالة. إذا كانت القيمة التراكمية TRUE، فترجع الدالة NORMDIST دالة التوزيع التراكمي؛ إذا كانت القيمة التراكمية FALSE، فإنها ترجع دالة الاحتمالات الجماعية.' },
        },
    },
    NORMINV: {
        description: 'تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.',
        abstract: 'تُرجع هذه الدالة عكس التوزيع التراكمي العادي للوسط والانحراف المعياري المحددين.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/norminv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. الاحتمال المطابق للتوزيع العادي.' },
            mean: { name: 'mean', detail: 'مطلوب. الوسط الحسابي للتوزيع.' },
            standardDev: { name: 'standard_dev', detail: 'مطلوب. وهي الانحراف المعياري للتوزيع.' },
        },
    },
    NORMSDIST: {
        description: 'تُرجع هذه الدالة دالة التوزيع التراكمي العادي القياسي. يحتوي التوزيع على وسط من 0 (صفر) وانحراف معياري من واحد. استخدم هذه الدالة بدلاً من جدول مناطق المنحنيات العادية القياسية.',
        abstract: 'تُرجع هذه الدالة دالة التوزيع التراكمي العادي القياسي. يحتوي التوزيع على وسط من 0 (صفر) وانحراف معياري من واحد. استخدم هذه الدالة بدلاً من جدول مناطق المنحنيات العادية القياسية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/normsdist-function',
            },
        ],
        functionParameter: {
            z: { name: 'z', detail: 'مطلوبة. القيمة التي تريد حساب التوزيع لها.' },
        },
    },
    NORMSINV: {
        description: 'تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.',
        abstract: 'تُرجع هذه الدالة عكس التوزيع التراكمي القياسي العادي. يحتوي التوزيع على وسط من صفر وانحراف معياري من واحد.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/normsinv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. الاحتمال المطابق للتوزيع العادي.' },
        },
    },
    PERCENTILE: {
        description: 'تُرجع هذه الدالة النسب المئوية للقيم في نطاق. ويمكنك استخدام هذه الدالة لتأسيس عتبة القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.',
        abstract: 'تُرجع هذه الدالة النسب المئوية للقيم في نطاق. ويمكنك استخدام هذه الدالة لتأسيس عتبة القبول. على سبيل المثال، يمكنك أن تتخذ قراراً باختبار المرشحين الذين سجلوا مجموع نقاط أعلى من القيمة المئوية 90.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/percentile-function',
            },
        ],
        functionParameter: {
            array: { name: 'array', detail: 'مطلوب. الصفيف أو نطاق البيانات الذي يعرِّف حالات النسبية.' },
            k: { name: 'k', detail: 'مطلوبة. القيمة المئوية في النطاق من 0 إلى 1، ضمناً.' },
        },
    },
    PERCENTRANK: {
        description: 'ترجع الدالة PERCENTRANK مرتبة قيمة في مجموعة بيانات كنسبة مئوية من مجموعة البيانات - بشكل أساسي، المركز النسبي للقيمة داخل مجموعة البيانات بأكملها. على سبيل المثال، يمكنك استخدام PERCENTRANK لتحديد مكانة درجة اختبار الفرد بين حقل جميع الدرجات لنفس الاختبار.',
        abstract: 'ترجع الدالة PERCENTRANK مرتبة قيمة في مجموعة بيانات كنسبة مئوية من مجموعة البيانات - بشكل أساسي، المركز النسبي للقيمة داخل مجموعة البيانات بأكملها. على سبيل المثال، يمكنك استخدام PERCENTRANK لتحديد مكانة درجة اختبار الفرد بين حقل جميع الدرجات لنفس الاختبار.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/percentrank-function',
            },
        ],
        functionParameter: {
            array: { name: 'array', detail: 'مطلوب. نطاق البيانات (أو الصفيف المحدد مسبقا) للقيم الرقمية التي يتم فيها تحديد ترتيب النسبة المئوية.' },
            x: { name: 'x', detail: 'مطلوبة. القيمة التي تريد معرفة الرتبة ضمن الصفيف لها.' },
            significance: { name: 'significance', detail: 'الاختياري. قيمة تعرّف عدد الأرقام ذات الأهمية لقيمة النسبة المئوية التي تم إرجاعها. في حالة حذف هذه الوسيطة، تستخدم الدالة PERCENTRANK ثلاثة أرقام (0‎.xxx).' },
        },
    },
    POISSON: {
        description: 'تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.',
        abstract: 'تُرجع هذه الدالة توزيع Poisson. يُعتبر التنبؤ بعدد الأحداث خلال فترة زمنية محددة أحد التطبيقات الشائعة لتوزيع Poisson، كالتنبؤ بعدد السيارات التي تصل إلى ساحة تفرض رسم مرور خلال دقيقة واحدة مثلاً.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/poisson-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. عدد الأحداث.' },
            mean: { name: 'mean', detail: 'مطلوب. القيمة الرقمية المتوقعة.' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. القيمة المنطقية التي تحدد نموذج توزيع الاحتمال الذي يتم إرجاعه. إذا كانت قيمة الوسيطة Cumulative تساوي TRUE، فتُرجع الدالة POISSON احتمال Poisson التراكمي بأن يكون عدد الأحداث العشوائية التي تحصل ما بين الصفر وx ضمناً؛ وإذا كانت قيمتها FALSE، فتُرجع دالة Poisson للاحتمالات غير التراكمية بأن يكون عدد الأحداث التي تحصل مساوياً لـ x تماماً.' },
        },
    },
    QUARTILE: {
        description: 'تُرجع هذه الدالة ربع مجموعة بيانات. غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE للبحث عن 25 في المئة من السكان من ذوي نسبة الدخل الأعلى.',
        abstract: 'تُرجع هذه الدالة ربع مجموعة بيانات. غالباً ما يتم استخدام الأرباع في المبيعات وبيانات الاستطلاعات لتقسيم السكان إلى مجموعات. على سبيل المثال، يمكنك استخدام QUARTILE للبحث عن 25 في المئة من السكان من ذوي نسبة الدخل الأعلى.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/quartile-function',
            },
        ],
        functionParameter: {
            array: { name: 'array', detail: 'مطلوب. الصفيف أو نطاق خلايا القيم الرقمية الذي تريد حساب قيمته الربعية.' },
            quart: { name: 'quart', detail: 'مطلوب. تشير إلى القيمة التي يجب إرجاعها.' },
        },
    },
    RANK: {
        description: 'تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة. (إذا كنت تريد فرز القائمة، ستكون مرتبة الرقم موضعه في القائمة.)',
        abstract: 'تُرجع هذه الدالة مرتبة رقم في قائمة من الأرقام. تمثّل مرتبة الرقم حجمه بالنسبة إلى أحجام القيم الأخرى في القائمة. (إذا كنت تريد فرز القائمة، ستكون مرتبة الرقم موضعه في القائمة.)',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/rank-function',
            },
        ],
        functionParameter: {
            number: { name: 'number', detail: 'مطلوب. الرقم الذي تريد العثور على مرتبته.' },
            ref: { name: 'ref', detail: 'مطلوب. مرجع إلى قائمة الأرقام. يتم تجاهل القيم غير الرقمية في المرجع.' },
            order: { name: 'order', detail: 'الاختياري. رقم يحدد كيفية ترتيب الرقم. إذا كان الترتيب يساوي 0 (صفر) أو إذا كان محذوفاً، يحدد Microsoft Excel مرتبة الرقم كما لو كان المرجع عبارة عن قائمة تم فرزها بترتيب تنازلي. إذا كان الترتيب عبارة عن قيمة غير صفرية، يحدد Microsoft Excel مرتبة الرقم كما لو كان المرجع عبارة عن قائمة تم فرزها بترتيب تصاعدي.' },
        },
    },
    STDEV: {
        description: 'تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).',
        abstract: 'تقدّر هذه الدالة الانحراف المعياري استناداً إلى عينة. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/stdev-function',
            },
        ],
        functionParameter: {
            number1: { name: 'number1', detail: 'مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى.' },
            number2: { name: 'number2', detail: 'الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق عينة من المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل.' },
        },
    },
    STDEVP: {
        description: 'تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).',
        abstract: 'تحسب هذه الدالة الانحراف المعياري استناداً إلى المحتوى بأكمله المحدد كوسيطات. الانحراف المعياري هو مقياس مدى بُعد القيم عن القيمة المتوسطة (الوسط).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/stdevp-function',
            },
        ],
        functionParameter: {
            number1: { name: 'number1', detail: 'مطلوب. وسيطة الرقم الأول التي تطابق المحتوى.' },
            number2: { name: 'number2', detail: 'الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق المحتوى. يمكنك أيضاً استخدام صفيف مفرد أو مرجع لأحد الصفائف بدلاً من الوسيطات المفصولة بفواصل.' },
        },
    },
    TDIST: {
        description: 'تُرجع هذه الدالة نقاط النسبة المئوية (الاحتمال) لتوزيع t للطلاب حيث تكون القيمة الرقمية (x) القيمة المحسوبة لـ t التي يجب حساب نقاط النسبة المئوية لها. يتم استخدام توزيع t في الاختبار الفرضي لنماذج صغيرة من مجموعات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.',
        abstract: 'تُرجع هذه الدالة نقاط النسبة المئوية (الاحتمال) لتوزيع t للطلاب حيث تكون القيمة الرقمية (x) القيمة المحسوبة لـ t التي يجب حساب نقاط النسبة المئوية لها. يتم استخدام توزيع t في الاختبار الفرضي لنماذج صغيرة من مجموعات البيانات. استخدم هذه الدالة بدلاً من جدول القيم الهامة لتوزيع t.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/tdist-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. القيمة الرقمية التي يتم تقييم التوزيع عندها.' },
            degFreedom: { name: 'degFreedom', detail: 'مطلوب. عدد صحيح يشير إلى عدد درجات الحرية.' },
            tails: { name: 'tails', detail: 'مطلوب. تحدد هذه الوسيطة عدد أطراف التوزيع التي يتم إرجاعها. إذا كانت قيمة الأطراف = 1، تُرجع الدالة TDIST التوزيع أحادي الطرف. إذا كانت قيمة الأطراف = 2، تُرجع الدالة TDIST التوزيع ثنائي الطرف.' },
        },
    },
    TINV: {
        description: 'إرجاع عكس توزيع t للطالب ثنائي الطرف.',
        abstract: 'إرجاع عكس توزيع t للطالب ثنائي الطرف.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/tinv-function',
            },
        ],
        functionParameter: {
            probability: { name: 'probability', detail: 'مطلوب. الاحتمال المقترن بتوزيع t للطالب ثنائي الطرف.' },
            degFreedom: { name: 'degFreedom', detail: 'مطلوب. عدد درجات الحرية التي تميز التوزيع.' },
        },
    },
    TTEST: {
        description: 'تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم TTEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.',
        abstract: 'تُرجع هذه الدالة الاحتمال المقترن باختبار t للطالب. استخدم TTEST لتحديد ما إذا كان من المحتمل وجود عينتين من محتويين مماثلين أساسيين لهما الوسط نفسه.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ttest-function',
            },
        ],
        functionParameter: {
            array1: { name: 'array1', detail: 'مطلوب. مجموعة البيانات الأولى.' },
            array2: { name: 'array2', detail: 'مطلوب. مجموعة البيانات الثانية.' },
            tails: { name: 'tails', detail: 'مطلوب. تحدد هذه الوسيطة عدد أطراف التوزيع. إذا كانت قيمة الأطراف = 1، تستخدم الدالة TTEST التوزيع وحيد الطرف. إذا كانت قيمة الأطراف = 2، تستخدم الدالة TTEST التوزيع وحيد الطرف.' },
            type: { name: 'type', detail: 'مطلوب. نوع اختبار t الذي يجب تأديته.' },
        },
    },
    VAR: {
        description: 'تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.',
        abstract: 'تقوم هذه الدالة بتقدير التباين استناداً إلى عينة.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/var-function',
            },
        ],
        functionParameter: {
            number1: { name: 'number1', detail: 'مطلوب. وسيطة الرقم الأول التي تطابق عينة من المحتوى.' },
            number2: { name: 'number2', detail: 'الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق عينة من المحتوى.' },
        },
    },
    VARP: {
        description: 'تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.',
        abstract: 'تحسب هذه الدالة التباين استناداً إلى المحتوى بأكمله.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/varp-function',
            },
        ],
        functionParameter: {
            number1: { name: 'number1', detail: 'مطلوب. وسيطة الرقم الأول التي تطابق المحتوى.' },
            number2: { name: 'number2', detail: 'الاختياري. وسيطات الأرقام من 2 حتى 255 التي تطابق المحتوى.' },
        },
    },
    WEIBULL: {
        description: 'تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.',
        abstract: 'تُرجع هذه الدالة توزيع Weibull. استخدم هذا التوزيع في تحليل ثبات النظام، كحساب متوسط وقت حدوث فشل في أحد الأجهزة.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/weibull-function',
            },
        ],
        functionParameter: {
            x: { name: 'x', detail: 'مطلوبة. القيمة التي يتم تقييم الدالة إليها.' },
            alpha: { name: 'alpha', detail: 'مطلوب. معلمة للتوزيع.' },
            beta: { name: 'beta', detail: 'مطلوب. معلمة للتوزيع.' },
            cumulative: { name: 'cumulative', detail: 'مطلوب. تحدد هذه الوسيطة شكل الدالة.' },
        },
    },
    ZTEST: {
        description: 'تُرجع هذه الدالة قيمة الاحتمال وحيدة الطرف لاختبار z. من خلال تعيين الوسط المفترض للمحتوى ?0، تقوم ZTEST بإرجاع احتمال أن يكون الوسط النموذجي أكبر من متوسط الملاحظات في مجموعة البيانات (الصفيف)، أي الوسط النموذجي الذي تمت ملاحظته.',
        abstract: 'تُرجع هذه الدالة قيمة الاحتمال وحيدة الطرف لاختبار z. من خلال تعيين الوسط المفترض للمحتوى ?0، تقوم ZTEST بإرجاع احتمال أن يكون الوسط النموذجي أكبر من متوسط الملاحظات في مجموعة البيانات (الصفيف)، أي الوسط النموذجي الذي تمت ملاحظته.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ztest-function',
            },
        ],
        functionParameter: {
            array: { name: 'array', detail: 'مطلوب. الصفيف أو نطاق البيانات لاختبار x بالمقابلة معه.' },
            x: { name: 'x', detail: 'مطلوبة. القيمة التي يجب اختبارها.' },
            sigma: { name: 'sigma', detail: 'الاختياري. الانحراف المعياري للمحتوى (معروف). في حالة حذفها، يتم استخدام الانحراف المعياري للعينة.' },
        },
    },
};

export default locale;
