/**
 * Copyright 2023-present DreamNum Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

import type enUS from './en-US';

const locale: typeof enUS = {
    DATE: {
        description: 'تقوم الدالة DATE بإرجاع الرقم التسلسلي المتتالي الذي يمثل تاريخاً معيناً.',
        abstract: 'تقوم الدالة DATE بإرجاع الرقم التسلسلي المتتالي الذي يمثل تاريخاً معيناً.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/date-function',
            },
        ],
        functionParameter: {
            year: { name: 'year', detail: 'يمكن أن تتكون قيمة الوسيطة year من رقم واحد إلى أربعة أرقام. يفسر Excel الوسيطة year وفق نظام التاريخ الذي يستخدمه جهازك. يستخدم Univer نظام التاريخ 1900 افتراضياً، أي أن التاريخ الأول هو 1 يناير 1900.' },
            month: { name: 'month', detail: 'عدد صحيح موجب أو سالب يمثل شهر السنة من 1 إلى 12 (يناير إلى ديسمبر).' },
            day: { name: 'day', detail: 'عدد صحيح موجب أو سالب يمثل يوم الشهر من 1 إلى 31.' },
        },
    },
    DATEDIF: {
        description: 'تحسب هذه الدالة عدد الأيام، أو الأشهر أو السنوات بين تاريخين.',
        abstract: 'تحسب هذه الدالة عدد الأيام، أو الأشهر أو السنوات بين تاريخين.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/datedif-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'تاريخ يمثل التاريخ الأول أو تاريخ البدء لفترة معينة. يمكن إدخال التواريخ كسلاسل نصية داخل علامات اقتباس (مثلاً، "30/1/2001")، أو كأرقام تسلسلية (مثلاً، 36921 الذي يمثل 30 يناير 2001، إذا كنت تستخدم نظام تاريخ 1900)، أو كنتائج صيغ أو دالات أخرى (مثلاً، DATEVALUE("2001/1/30")‎).' },
            endDate: { name: 'end_date', detail: 'تاريخ يمثّل آخر تاريخ، أو تاريخ الانتهاء، في الفترة الزمنية.' },
            unit: { name: 'Unit', detail: 'نوع المعلومات التي تريد إرجاعها، حيث: الوحدة****إرجاع " Y "عدد السنوات الكاملة في الفترة." M "عدد الأشهر المكتملة في الفترة." D "عدد الأيام في الفترة." MD "الفرق بين الأيام في start_date end_date. يتم تجاهل الأشهر والسنوات في التواريخ. الهامه: لا نوصي باستخدام الوسيطة "MD"، حيث توجد قيود معروفة عليها. راجع قسم المشكلات المعروفة أدناه." YM "الفرق بين الأشهر في start_date end_date. يتم تجاهل أيام وسنوات التواريخ" YD "الفرق بين أيام start_date end_date. يتم تجاهل السنوات في التواريخ.' },
        },
    },
    DATEVALUE: {
        description: 'تحول الدالة DATEVALUE التاريخ المخزن كنص إلى رقم تسلسلي يتعرف عليه Excel كتاريخ. على سبيل المثال، تقوم الصيغة ‎ =DATEVALUE("1/1/2008")‎ بإرجاع 39448، وهو الرقم التسلسلي للتاريخ 1/1/2008. تذكر أنه على الرغم من ذلك، فقد يؤدي إعداد تاريخ النظام على الكمبيوتر لديك إلى الحصول على نتائج للدالة DATEVALUE تختلف عن نتيجة هذا المثال',
        abstract: 'تحول الدالة DATEVALUE التاريخ المخزن كنص إلى رقم تسلسلي يتعرف عليه Excel كتاريخ. على سبيل المثال، تقوم الصيغة ‎ =DATEVALUE("1/1/2008")‎ بإرجاع 39448، وهو الرقم التسلسلي للتاريخ 1/1/2008. تذكر أنه على الرغم من ذلك، فقد يؤدي إعداد تاريخ النظام على الكمبيوتر لديك إلى الحصول على نتائج للدالة DATEVALUE تختلف عن نتيجة هذا المثال',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/datevalue-function',
            },
        ],
        functionParameter: {
            dateText: { name: 'date_text', detail: 'مطلوب. وهي النص الذي يمثل تاريخاً بتنسيق تاريخ لـ Excel أو مرجعاً للخلية التي تحتوي على نص يمثل تاريخاً بتنسيق تاريخ لـ Excel. على سبيل المثال، يعد التاريخ "30/1/2008" أو "30 - يناير - 2008" عبارة عن سلسلة نصية موجودة داخل علامتي اقتباس وتمثل تاريخاً. باستخدام نظام التاريخ الافتراضي في Microsoft Excel for Windows، يجب أن تمثل الوسيطة date_text تاريخا بين 1 يناير 1900 و31 ديسمبر 9999. ترجع الدالة DATEVALUE #VALUE! قيمة الخطأ إذا كانت قيمة الوسيطة date_text تقع خارج هذا النطاق. إذا تم حذف جزء السنة من الوسيطة date_text ، تستخدم الدالة DATEVALUE السنة الحالية من الساعة المضمنة في الكمبيوتر. يتم تجاهل معلومات الوقت في الوسيطة date_text .' },
        },
    },
    DAY: {
        description: 'تُرجع هذه الدالة يوم تاريخ ما ممثلاً برقم تسلسلي. ويكون اليوم عدداً صحيحاً يتراوح بين 1 و31.',
        abstract: 'تُرجع هذه الدالة يوم تاريخ ما ممثلاً برقم تسلسلي. ويكون اليوم عدداً صحيحاً يتراوح بين 1 و31.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/day-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. تاريخ اليوم الذي تحاول العثور عليه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص .' },
        },
    },
    DAYS: {
        description: 'تُرجع عدد الأيام بين تاريخين.',
        abstract: 'تُرجع عدد الأيام بين تاريخين.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/days-function',
            },
        ],
        functionParameter: {
            endDate: { name: 'end_date', detail: 'مطلوب. وتُعد كل من الوسيطتين Start_date وEnd_date التاريخين اللذين تريد معرفة عدد الأيام بينهما.' },
            startDate: { name: 'start_date', detail: 'مطلوب. وتُعد كل من الوسيطتين Start_date وEnd_date التاريخين اللذين تريد معرفة عدد الأيام بينهما.' },
        },
    },
    DAYS360: {
        description: 'تُرجع الدالة DAYS360 عدد الأيام بين تاريخين استناداً إلى سنة من 360 يوماً (اثنا عشر شهراً يتألف كلٌ منها من 30 يوماً)، تُستخدم في بعض الحسابات الخاصة بالمحاسبة. استخدم هذه الدالة للمساعدة في حساب الدفعات إذا كان نظام المحاسبة يستند إلى 12 شهراً و30 يوماً في الشهر.',
        abstract: 'تُرجع الدالة DAYS360 عدد الأيام بين تاريخين استناداً إلى سنة من 360 يوماً (اثنا عشر شهراً يتألف كلٌ منها من 30 يوماً)، تُستخدم في بعض الحسابات الخاصة بالمحاسبة. استخدم هذه الدالة للمساعدة في حساب الدفعات إذا كان نظام المحاسبة يستند إلى 12 شهراً و30 يوماً في الشهر.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/days360-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'start_date وend_date هما التاريخان اللذان تريد معرفة عدد الأيام بينهما.' },
            endDate: { name: 'end_date', detail: 'start_date وend_date هما التاريخان اللذان تريد معرفة عدد الأيام بينهما.' },
            method: { name: 'method', detail: 'قيمة منطقية تحدد ما إذا كان يجب استخدام الطريقة الأمريكية أو الأوروبية في الحساب.' },
        },
    },
    EDATE: {
        description: 'تُرجع الرقم التسلسلي الذي يمثل التاريخ وهو عدد الأشهر المشار إليه قبل تاريخ (start_date) محدد أو بعده. استخدم EDATE لحساب تواريخ الاستحقاق أو تواريخ استحقاق الدفع التي تقع في اليوم نفسه من شهر تاريخ الإصدار.',
        abstract: 'تُرجع الرقم التسلسلي الذي يمثل التاريخ وهو عدد الأشهر المشار إليه قبل تاريخ (start_date) محدد أو بعده. استخدم EDATE لحساب تواريخ الاستحقاق أو تواريخ استحقاق الدفع التي تقع في اليوم نفسه من شهر تاريخ الإصدار.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/edate-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'مطلوب. تاريخ يمثل تاريخ البدء. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص .' },
            months: { name: 'months', detail: 'مطلوب. عدد الأشهر التي تسبق تاريخ_البدء أو تليه. تشير القيمة الموجبة للأشهر إلى تاريخ مستقبلي، في حين تشير القيمة السالبة إلى تاريخ سابق.' },
        },
    },
    EOMONTH: {
        description: 'تُرجع هذه الدالة الرقم التسلسلي لليوم الأخير من الشهر وهو عدد الأشهر المشار إليه قبل تاريخ_البدء أو بعده. استخدم الدالة EOMONTH لحساب تواريخ التسديد أو تواريخ الاستحقاق التي تقع في اليوم الأخير من الشهر.',
        abstract: 'تُرجع هذه الدالة الرقم التسلسلي لليوم الأخير من الشهر وهو عدد الأشهر المشار إليه قبل تاريخ_البدء أو بعده. استخدم الدالة EOMONTH لحساب تواريخ التسديد أو تواريخ الاستحقاق التي تقع في اليوم الأخير من الشهر.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/eomonth-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'مطلوب. تاريخ يمثل تاريخ البدء. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص .' },
            months: { name: 'months', detail: 'مطلوب. عدد الأشهر التي تسبق تاريخ_البدء أو تليه. تشير القيمة الموجبة للأشهر إلى تاريخ مستقبلي، في حين تشير القيمة السالبة إلى تاريخ سابق. ملاحظة إذا لم يكن عدد الأشهر عبارة عن رقم صحيح، فيتم اقتطاعه.' },
        },
    },
    EPOCHTODATE: {
        description: 'يحوّل طابع وقت حقبة Unix بالثواني أو المللي ثانية أو الميكروثانية إلى تاريخ ووقت بالتوقيت العالمي المنسق (UTC).',
        abstract: 'يحوّل طابع وقت حقبة Unix بالثواني أو المللي ثانية أو الميكروثانية إلى تاريخ ووقت بالتوقيت العالمي المنسق (UTC).',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.google.com/docs/answer/13193461?hl=ar',
            },
        ],
        functionParameter: {
            timestamp: { name: 'timestamp', detail: 'طابع زمني لعصر Unix، بالثواني أو المللي ثانية أو الميكروثانية.' },
            unit: { name: 'unit', detail: '[اختياري — القيمة الافتراضية 1]: وحدة الزمن التي يُعبَّر بها عن الطابع الزمني.' },
        },
    },
    HOUR: {
        description: 'تُرجع هذه الدالة الساعة من قيمة وقت. وتظهر الساعة كعدد صحيح، يتراوح من 0 (12:00 ص) إلى 23 (11:00 م).',
        abstract: 'تُرجع هذه الدالة الساعة من قيمة وقت. وتظهر الساعة كعدد صحيح، يتراوح من 0 (12:00 ص) إلى 23 (11:00 م).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/hour-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. الوقت الذي يحتوي على الساعة التي تريد البحث عنها. يمكن إدخال الأوقات كسلاسل نصية بين علامتي اقتباس (على سبيل المثال، "6:45 م")، أو كأرقام عشرية (على سبيل المثال، 0,78125، الذي يمثل "6:45 م")، أو كنتائج صيغ أو دالات أخرى (على سبيل المثال، TIMEVALUE("6:45 م")‎).' },
        },
    },
    ISOWEEKNUM: {
        description: 'تُرجع هذه الدالة رقم أسبوع ISO من العام لتاريخ محدد.',
        abstract: 'تُرجع هذه الدالة رقم أسبوع ISO من العام لتاريخ محدد.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/isoweeknum-function',
            },
        ],
        functionParameter: {
            date: { name: 'date', detail: 'مطلوب. التاريخ هو رمز التاريخ والوقت الذي يستخدمه Excel لحساب التاريخ والوقت.' },
        },
    },
    MINUTE: {
        description: 'إرجاع الدقائق من قيمة للوقت. تظهر قيمة الدقائق كعدد صحيح، يتراوح بين 0 و59.',
        abstract: 'إرجاع الدقائق من قيمة للوقت. تظهر قيمة الدقائق كعدد صحيح، يتراوح بين 0 و59.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/minute-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. الوقت الذي يحتوي على الدقيقة التي تريد البحث عنها. يمكن إدخال الأوقات كسلاسل نصية بين علامتي اقتباس (على سبيل المثال، "6:45 م")، أو كأرقام عشرية (على سبيل المثال، 0.78125، الذي يمثل "6:45 م")، أو كنتائج صيغ أو دالات أخرى (على سبيل المثال، ("TIMEVALUE("6:45 PM).' },
        },
    },
    MONTH: {
        description: 'تُرجع هذه الدالة شهر تاريخ ما يتم تمثيله برقم تسلسلي. ويظهر الشهر كعدد صحيح، يتراوح بين 1 (يناير) و12 (ديسمبر).',
        abstract: 'تُرجع هذه الدالة شهر تاريخ ما يتم تمثيله برقم تسلسلي. ويظهر الشهر كعدد صحيح، يتراوح بين 1 (يناير) و12 (ديسمبر).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/month-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. تاريخ الشهر الذي تحاول البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص .' },
        },
    },
    NETWORKDAYS: {
        description: 'تُرجع هذه الدالة أيام العمل الكاملة بين تاريخ البدء وتاريخ الانتهاء. وتُستبعد نهايات الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة من أيام العمل. استخدم NETWORKDAYS لحساب عوائد الموظفين المستحقة بالاستناد إلى عدد أيام العمل في فترة محددة.',
        abstract: 'تُرجع هذه الدالة أيام العمل الكاملة بين تاريخ البدء وتاريخ الانتهاء. وتُستبعد نهايات الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة من أيام العمل. استخدم NETWORKDAYS لحساب عوائد الموظفين المستحقة بالاستناد إلى عدد أيام العمل في فترة محددة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/networkdays-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'مطلوب. تاريخ يمثل تاريخ البدء.' },
            endDate: { name: 'end_date', detail: 'مطلوب. تاريخ يمثل تاريخ الانتهاء.' },
            holidays: { name: 'holidays', detail: 'الاختياري. هي نطاق اختياري يحتوي على واحد أو أكثر من التواريخ المطلوب استبعادها من تقويم العمل، مثل العطلات الرسمية الموحدة والإجازات الشخصية. يمكن أن تكون القائمة عبارة عن نطاق من الخلايا التي تحتوي على التواريخ أو ثابت صفيف من الأرقام التسلسلية التي تمثل التواريخ.' },
        },
    },
    NETWORKDAYS_INTL: {
        description: 'تُرجع هذه الدالة عدد أيام العمل الكاملة بين تاريخين باستخدام المعلمات لتحديد أيام نهايات الأسبوع وعددها. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة.',
        abstract: 'تُرجع هذه الدالة عدد أيام العمل الكاملة بين تاريخين باستخدام المعلمات لتحديد أيام نهايات الأسبوع وعددها. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى تم تحديدها على أنها أيام عطلة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/networkdays-intl-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'تاريخ يمثل تاريخ البدء.' },
            endDate: { name: 'end_date', detail: 'تاريخ يمثل تاريخ الانتهاء.' },
            weekend: { name: 'weekend', detail: 'رقم أو سلسلة نصية تحدد أيام عطلة نهاية الأسبوع.' },
            holidays: { name: 'holidays', detail: 'نطاق اختياري يتضمن تاريخاً واحداً أو أكثر لاستبعاده من تقويم العمل، مثل العطلات الرسمية أو العطلات المتحركة.' },
        },
    },
    NOW: {
        description: 'تُرجع هذه الدالة الرقم التسلسلي للتاريخ والوقت الحاليين. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تنسيق يتطابق مع تنسيق الوقت والتاريخ المحدد في الإعدادات الإقليمية. ويمكنك تغيير تنسيق التاريخ والوقت للخلية باستخدام الأوامر الموجودة في مجموعة رقم ضمن علامة التبويب الشريط الرئيسي على الشريط.',
        abstract: 'تُرجع هذه الدالة الرقم التسلسلي للتاريخ والوقت الحاليين. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تنسيق يتطابق مع تنسيق الوقت والتاريخ المحدد في الإعدادات الإقليمية. ويمكنك تغيير تنسيق التاريخ والوقت للخلية باستخدام الأوامر الموجودة في مجموعة رقم ضمن علامة التبويب الشريط الرئيسي على الشريط.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/now-function',
            },
        ],
        functionParameter: {
        },
    },
    SECOND: {
        description: 'تُرجع هذه الدالة الثواني من قيمة وقت. وتظهر الثانية كعدد صحيح يتراوح بين 0 و59.',
        abstract: 'تُرجع هذه الدالة الثواني من قيمة وقت. وتظهر الثانية كعدد صحيح يتراوح بين 0 و59.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/second-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. الوقت الذي يحتوي على الثواني التي تريد العثور عليها. يمكن إدخال الأوقات كسلاسل نصية بين علامات اقتباس (مثلاً، "6:45 م")، أو كأرقام عشرية (مثلاً 0.78125، وهي تشير إلى "6:45 م")، أو كنتائج لصيغ أو دالات أخرى (مثلاً TIMEVALUE("6:45 PM")‎‏).' },
        },
    },
    TIME: {
        description: 'تُرجع هذه الدالة الرقم العشري لوقت محدد. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، فيتم تنسيق الخلية كتاريخ.',
        abstract: 'تُرجع هذه الدالة الرقم العشري لوقت محدد. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، فيتم تنسيق الخلية كتاريخ.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/time-function',
            },
        ],
        functionParameter: {
            hour: { name: 'hour', detail: 'مطلوب. رقم من 0 (صفر) إلى 32767 يمثل الساعة. سيتم تقسيم أي قيمة أكبر من 23 على 24، ويُعتبر الباقي قيمة الساعة. على سبيل المثال، TIME(27,0,0) = TIME(3,0,0) = .125 أو 3:00 ص.' },
            minute: { name: 'minute', detail: 'مطلوب. رقم من 0 إلى 32767 يمثل الدقيقة. سيتم تحويل أي قيمة أكبر من 59 إلى ساعات ودقائق. على سبيل المثال، TIME(0,750,0) = TIME(12,30,0) = .520833 أو 12:30 م.' },
            second: { name: 'second', detail: 'مطلوب. رقم من 0 إلى 32767 يمثل الثانية. سيتم تحويل أي قيمة أكبر من 59 إلى ساعات، ودقائق، وثوانٍ. على سبيل المثال، TIME(0,0,2000) = TIME(0,33,22) = .023148 أو 12:33:20 ص.' },
        },
    },
    TIMEVALUE: {
        description: 'تُرجع هذه الدالة الرقم العشري للوقت ممثلاً بسلسلة نصية. إن الرقم العشري عبارة عن قيمة تتراوح بين 0 (صفر) و0,99988426 وتمثل الأوقات من 0:00:00 (12:00:00 ص) إلى 23:59:59 (11:59:59 م).',
        abstract: 'تُرجع هذه الدالة الرقم العشري للوقت ممثلاً بسلسلة نصية. إن الرقم العشري عبارة عن قيمة تتراوح بين 0 (صفر) و0,99988426 وتمثل الأوقات من 0:00:00 (12:00:00 ص) إلى 23:59:59 (11:59:59 م).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/timevalue-function',
            },
        ],
        functionParameter: {
            timeText: { name: 'time_text', detail: 'مطلوب. سلسلة نصية تمثل وقتاً بأي من تنسيقات الوقت الخاصة بـ Microsoft Excel؛ مثلاً، "6:45 م" و"18:45" عبارة عن سلسلتين نصيتين داخل علامات اقتباس تمثلان وقتاً.' },
        },
    },
    TO_DATE: {
        description: 'يحوّل رقماً مقدماً إلى تاريخ.',
        abstract: 'يحوّل رقماً مقدماً إلى تاريخ.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.google.com/docs/answer/3094239?hl=ar',
            },
        ],
        functionParameter: {
            value: { name: 'value', detail: 'الوسيطة أو مرجع الخلية المراد تحويله إلى تاريخ. إذا كانت value رقماً أو مرجعاً إلى خلية تحتوي على قيمة رقمية، فترجع TO_DATE القيمة بعد تحويلها إلى تاريخ، باعتبارها عدد الأيام منذ 30 ديسمبر 1899. تُفسَّر القيم السالبة على أنها أيام قبل ذلك التاريخ، وتشير القيم الكسرية إلى الوقت المنقضي بعد منتصف الليل. إذا لم تكن value رقماً أو مرجعاً إلى خلية تحتوي على قيمة رقمية، فترجع TO_DATE القيمة دون تغيير.' },
        },
    },
    TODAY: {
        description: 'ترجع الدالة TODAY الرقم التسلسلي للتاريخ الحالي. الرقم التسلسلي عبارة عن تعليمة برمجية للتاريخ والوقت يستخدمها Excel لحسابات التاريخ والوقت. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تاريخ . إذا كنت تريد عرض الرقم التسلسلي، فعليك تغيير تنسيق الخلية إلى عام أو رقم .',
        abstract: 'ترجع الدالة TODAY الرقم التسلسلي للتاريخ الحالي. الرقم التسلسلي عبارة عن تعليمة برمجية للتاريخ والوقت يستخدمها Excel لحسابات التاريخ والوقت. إذا كانت الخلية بالتنسيق عام قبل إدخال الدالة، يقوم Excel بتغيير تنسيق الخلية إلى تاريخ . إذا كنت تريد عرض الرقم التسلسلي، فعليك تغيير تنسيق الخلية إلى عام أو رقم .',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/today-function',
            },
        ],
        functionParameter: {
        },
    },
    WEEKDAY: {
        description: 'تُرجع هذه الدالة يوم الأسبوع المطابق لأحد التواريخ. يتم تقديم اليوم كعدد صحيح، وهو يتراوح من 1 (الأحد) إلى 7 (السبت)، بشكل افتراضي.',
        abstract: 'تُرجع هذه الدالة يوم الأسبوع المطابق لأحد التواريخ. يتم تقديم اليوم كعدد صحيح، وهو يتراوح من 1 (الأحد) إلى 7 (السبت)، بشكل افتراضي.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/weekday-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. رقم تسلسلي يمثل تاريخ اليوم الذي تحاول البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص.' },
            returnType: { name: 'return_type', detail: 'الاختياري. رقم يحدد نوع القيمة المرجعة.' },
        },
    },
    WEEKNUM: {
        description: 'تُرجع رقم الأسبوع لتاريخ محدد. على سبيل المثال، إن الأسبوع الذي يقع فيه التاريخ 1 يناير هو الأسبوع الأول في السنة ورقمه الأسبوع 1.',
        abstract: 'تُرجع رقم الأسبوع لتاريخ محدد. على سبيل المثال، إن الأسبوع الذي يقع فيه التاريخ 1 يناير هو الأسبوع الأول في السنة ورقمه الأسبوع 1.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/weeknum-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. تاريخ يقع ضمن الأسبوع. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص.' },
            returnType: { name: 'return_type', detail: 'الاختياري. رقم يحدد اليوم الذي يبدأ عنده الأسبوع. إن القيمة الافتراضية هي 1.' },
        },
    },
    WORKDAY: {
        description: 'تُرجع رقماً يمثل تاريخاً يشير إلى عدد أيام العمل قبل تاريخ معين (تاريخ البدء) أو بعده. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى يتم تحديدها على أنها أيام عطلة. استخدم WORKDAY لاستبعاد عطلات نهاية الأسبوع أو أيام العطلة الرسمية عند حساب تواريخ استحقاق الفواتير أو مواعيد التسليم المتوقعة أو عدد الأيام التي تم فيها إنجاز العمل.',
        abstract: 'تُرجع رقماً يمثل تاريخاً يشير إلى عدد أيام العمل قبل تاريخ معين (تاريخ البدء) أو بعده. وتُستبعد من أيام العمل عطلات نهاية الأسبوع وأي تواريخ أخرى يتم تحديدها على أنها أيام عطلة. استخدم WORKDAY لاستبعاد عطلات نهاية الأسبوع أو أيام العطلة الرسمية عند حساب تواريخ استحقاق الفواتير أو مواعيد التسليم المتوقعة أو عدد الأيام التي تم فيها إنجاز العمل.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/workday-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'مطلوب. تاريخ يمثل تاريخ البدء.' },
            days: { name: 'days', detail: 'مطلوب. عدد الأيام غير عطلات نهاية الأسبوع وغير أيام العطلة الرسمية الواقعة قبل تاريخ البدء start_date أو بعده. ينتج عن القيمة الموجبة للوسيطة days تاريخ مستقبلي؛ وينتج عن القيمة السالبة تاريخ ماضٍ.' },
            holidays: { name: 'holidays', detail: 'الاختياري. هي قائمة اختيارية تحتوي على واحد أو أكثر من التواريخ المطلوب استبعادها من تقويم العمل، مثل العطلات الرسمية الموحدة والإجازات الشخصية. يمكن أن تكون القائمة عبارة عن نطاق من الخلايا التي تحتوي على التواريخ أو ثابت صفيف من الأرقام التسلسلية التي تمثل التواريخ.' },
        },
    },
    WORKDAY_INTL: {
        description: 'ترجع هذه الدالة الرقم التسلسلي للتاريخ قبل عدد محدد من أيام العمل أو بعده باستخدام معلمات عطلة نهاية الأسبوع المخصصة. يمكن أن تشير معلمات عطلة نهاية الأسبوع الاختيارية إلى أيام عطلة نهاية الأسبوع وعددها. لاحظ أن أيام عطلة نهاية الأسبوع وأي أيام محددة كعطلات لا تعتبر أيام عمل.',
        abstract: 'ترجع هذه الدالة الرقم التسلسلي للتاريخ قبل عدد محدد من أيام العمل أو بعده باستخدام معلمات عطلة نهاية الأسبوع المخصصة. يمكن أن تشير معلمات عطلة نهاية الأسبوع الاختيارية إلى أيام عطلة نهاية الأسبوع وعددها. لاحظ أن أيام عطلة نهاية الأسبوع وأي أيام محددة كعطلات لا تعتبر أيام عمل.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/workday-intl-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'مطلوب. تاريخ البدء، تم اقتطاعه إلى عدد صحيح.' },
            days: { name: 'days', detail: 'مطلوب. عدد أيام العمل قبل تاريخ البدء start_date أو بعده. ينتج عن القيمة الموجبة تاريخ مستقبلي؛ ينتج عن القيمة السالبة تاريخ سابق؛ ينتج عن القيمة الصفرية start_date المحددة بالفعل . يتم اقتطاع إزاحة اليوم إلى عدد صحيح.' },
            weekend: { name: 'weekend', detail: 'الاختياري. إذا تم استخدامه، فهذا يشير إلى أيام الأسبوع التي هي أيام عطلة نهاية الأسبوع ولا تعتبر أيام عمل. وسيطة نهاية الأسبوع هي رقم عطلة نهاية الأسبوع أو سلسلة تحدد وقت حدوث عطلات نهاية الأسبوع. تشير قيم أرقام عطلة نهاية الأسبوع إلى أيام عطلة نهاية الأسبوع كما هو موضح أدناه.' },
            holidays: { name: 'holidays', detail: 'هذه وسيطة اختيارية في نهاية بناء الجملة. يحدد مجموعة اختيارية من تاريخ واحد أو أكثر سيتم استبعاده من تقويم يوم العمل. يجب أن تكون العطلات عبارة عن نطاق خلايا يحتوي على التواريخ - أو ثابت صفيف للقيم التسلسلية التي تمثل تلك التواريخ. يمكن أن يكون ترتيب التواريخ أو القيم التسلسلية في العطلات عشوائياً.' },
        },
    },
    YEAR: {
        description: 'تُرجع السنة المطابقة لتاريخ معيّن. ويتم إرجاع السنة كعدد صحيح ضمن النطاق 1900-9999.',
        abstract: 'تُرجع السنة المطابقة لتاريخ معيّن. ويتم إرجاع السنة كعدد صحيح ضمن النطاق 1900-9999.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/year-function',
            },
        ],
        functionParameter: {
            serialNumber: { name: 'serial_number', detail: 'مطلوب. تاريخ السنة الذي تريد البحث عنه. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2025,5,23) لليوم الثالث والعشرين من مايو 2025. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص.' },
        },
    },
    YEARFRAC: {
        description: 'يحسب YEARFRAC كسر السنة ممثلاً بعدد الأيام الكاملة التي تقع بين تاريخين (تاريخ البدء start_date وتاريخ الانتهاء end_date ). على سبيل المثال، يمكنك استخدام YEARFRAC لتحديد نسبة الالتزامات والمنافع خلال سنة كاملة والتي تريد تعيينها لفترة معينة.',
        abstract: 'يحسب YEARFRAC كسر السنة ممثلاً بعدد الأيام الكاملة التي تقع بين تاريخين (تاريخ البدء start_date وتاريخ الانتهاء end_date ). على سبيل المثال، يمكنك استخدام YEARFRAC لتحديد نسبة الالتزامات والمنافع خلال سنة كاملة والتي تريد تعيينها لفترة معينة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/yearfrac-function',
            },
        ],
        functionParameter: {
            startDate: { name: 'start_date', detail: 'تاريخ يمثل تاريخ البدء.' },
            endDate: { name: 'end_date', detail: 'تاريخ يمثل تاريخ الانتهاء.' },
            basis: { name: 'basis', detail: 'نوع أساس احتساب الأيام المراد استخدامه.' },
        },
    },
};

export default locale;
