/**
 * Copyright 2023-present DreamNum Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

import type enUS from './en-US';

const locale: typeof enUS = {
    ACCRINT: {
        description: 'تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة دورية عنها.',
        abstract: 'تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة دورية عنها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/accrint-function',
            },
        ],
        functionParameter: {
            issue: { name: 'issue', detail: 'مطلوب. وهي تاريخ إصدار الورقة المالية.' },
            firstInterest: { name: 'first_interest', detail: 'مطلوب. وهي تاريخ أول فائدة للورقة المالية.' },
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            par: { name: 'par', detail: 'مطلوب. وهي قيمة سعر التداول للورقة المالية. إذا تم إهمال سعر التداول، فستستخدم الدالة ACCRINT القيمة 1000 ر.س..' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
            calcMethod: { name: 'calc_method', detail: 'الاختياري. وهي قيمة منطقية تحدد طريقة حساب الفائدة المستحقة الإجمالية عند تأخر تاريخ التسوية عن تاريخ first_interest. تُرجع قيمة TRUE (1)‎ الفائدة المستحقة الإجمالية من الإصدار إلى التسوية. وتُرجع قيمة FALSE (0)‎ الفائدة المستحقة من first_interest إلى التسوية. إذا لم تُدخل قيمة الوسيطة، فسيتم تعيينها بشكلٍ افتراضي إلى TRUE.' },
        },
    },
    ACCRINTM: {
        description: 'تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة عنها في موعد الاستحقاق.',
        abstract: 'تُرجع الفائدة المستحقة لورقة مالية يتم سداد فائدة عنها في موعد الاستحقاق.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/accrintm-function',
            },
        ],
        functionParameter: {
            issue: { name: 'issue', detail: 'مطلوب. وهي تاريخ إصدار الورقة المالية.' },
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            par: { name: 'par', detail: 'مطلوب. وهي قيمة سعر التداول للورقة المالية. إذا تم إهمال سعر التداول، فستستخدم الدالة ACCRINTM القيمة 1000 ر.س..' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    AMORDEGRC: {
        description: 'تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فيتم وضع الإهلاك المقسم بالتناسب في الاعتبار. تتشابه هذه الدالة مع الدالة AMORLINC، باستثناء أنه يتم تطبيق معامل الإهلاك على الحساب استناداً إلى فترة عمر الأصول.',
        abstract: 'تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فيتم وضع الإهلاك المقسم بالتناسب في الاعتبار. تتشابه هذه الدالة مع الدالة AMORLINC، باستثناء أنه يتم تطبيق معامل الإهلاك على الحساب استناداً إلى فترة عمر الأصول.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/amordegrc-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. وهي تكلفة الأصل.' },
            datePurchased: { name: 'date_purchased', detail: 'مطلوب. وهي تاريخ شراء الأصل.' },
            firstPeriod: { name: 'first_period', detail: 'مطلوب. وهي تاريخ نهاية الفترة الأولى.' },
            salvage: { name: 'salvage', detail: 'مطلوب. وهي القيمة الباقية في نهاية فترة عمر الأصل.' },
            period: { name: 'period', detail: 'مطلوب. وهي الفترة الزمنية.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي معدل الإهلاك.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي أساس حساب السنة المستخدم.' },
        },
    },
    AMORLINC: {
        description: 'تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فإنه يتم وضع الإهلاك المقسم بالتناسب في الاعتبار.',
        abstract: 'تُرجع الإهلاك لكل فترة محاسبية. يتم توفير هذه الدالة لنظام المحاسبة الفرنسي. وإذا تم شراء أحد الأصول في منتصف الفترة المحاسبية، فإنه يتم وضع الإهلاك المقسم بالتناسب في الاعتبار.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/amorlinc-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. وهي تكلفة الأصل.' },
            datePurchased: { name: 'date_purchased', detail: 'مطلوب. وهي تاريخ شراء الأصل.' },
            firstPeriod: { name: 'first_period', detail: 'مطلوب. وهي تاريخ نهاية الفترة الأولى.' },
            salvage: { name: 'salvage', detail: 'مطلوب. وهي القيمة الباقية في نهاية فترة عمر الأصل.' },
            period: { name: 'period', detail: 'مطلوب. وهي الفترة الزمنية.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي معدل الإهلاك.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي أساس حساب السنة المستخدم.' },
        },
    },
    COUPDAYBS: {
        description: 'تُرجع الدالة COUPDAYBS عدد الأيام من بداية فترة القسيمة وحتى تاريخ التسوية الخاص بها.',
        abstract: 'تُرجع الدالة COUPDAYBS عدد الأيام من بداية فترة القسيمة وحتى تاريخ التسوية الخاص بها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/coupdaybs-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    COUPDAYS: {
        description: 'تُرجع عدد الأيام في فترة القسيمة التي تتضمن تاريخ التسوية.',
        abstract: 'تُرجع عدد الأيام في فترة القسيمة التي تتضمن تاريخ التسوية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/coupdays-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    COUPDAYSNC: {
        description: 'تُرجع عدد الأيام بدايةً من تاريخ التسوية وحتى تاريخ القسيمة التالي.',
        abstract: 'تُرجع عدد الأيام بدايةً من تاريخ التسوية وحتى تاريخ القسيمة التالي.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/coupdaysnc-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    COUPNCD: {
        description: 'تُرجع رقماً يمثل تاريخ القسيمة التالي بعد تاريخ التسوية.',
        abstract: 'تُرجع رقماً يمثل تاريخ القسيمة التالي بعد تاريخ التسوية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/coupncd-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    COUPNUM: {
        description: 'تُرجع عدد القسائم المستحقة الدفع بين تاريخ التسوية وتاريخ الاستحقاق، مقرباً للأعلى إلى أقرب عدد صحيح للقسيمة.',
        abstract: 'تُرجع عدد القسائم المستحقة الدفع بين تاريخ التسوية وتاريخ الاستحقاق، مقرباً للأعلى إلى أقرب عدد صحيح للقسيمة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/coupnum-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    COUPPCD: {
        description: 'تُرجع رقماً يمثل تاريخ القسيمة السابق قبل تاريخ التسوية.',
        abstract: 'تُرجع رقماً يمثل تاريخ القسيمة السابق قبل تاريخ التسوية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/couppcd-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    CUMIPMT: {
        description: 'تُرجع الفائدة التراكمية المدفوعة لقرض بين end_period وstart_period.',
        abstract: 'تُرجع الفائدة التراكمية المدفوعة لقرض بين end_period وstart_period.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/cumipmt-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. وهي معدل الفائدة.' },
            nper: { name: 'nper', detail: 'مطلوب. وهي العدد الإجمالي لفترات دفعات السداد.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية.' },
            startPeriod: { name: 'start_period', detail: 'مطلوب. وهي الفترة الأولى في الحساب. يتم ترقيم فترات دفعات السداد بدءاً بـ 1.' },
            endPeriod: { name: 'end_period', detail: 'مطلوب. وهي الفترة الأخيرة في الحساب.' },
            type: { name: 'type', detail: 'مطلوب. وهي توقيت الدفع.' },
        },
    },
    CUMPRINC: {
        description: 'تُرجع رأس المال التراكمي المدفوع لقرض بين start_period وend_period.',
        abstract: 'تُرجع رأس المال التراكمي المدفوع لقرض بين start_period وend_period.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/cumprinc-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. وهي معدل الفائدة.' },
            nper: { name: 'nper', detail: 'مطلوب. وهي العدد الإجمالي لفترات دفعات السداد.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية.' },
            startPeriod: { name: 'start_period', detail: 'مطلوب. وهي الفترة الأولى في الحساب. يتم ترقيم فترات دفعات السداد بدءاً بـ 1.' },
            endPeriod: { name: 'end_period', detail: 'مطلوب. وهي الفترة الأخيرة في الحساب.' },
            type: { name: 'type', detail: 'مطلوب. وهي توقيت الدفع.' },
        },
    },
    DB: {
        description: 'تُرجع هذه الدالة إهلاك أصول لفترة معينة باستخدام أسلوب الرصيد المتناقص الثابت.',
        abstract: 'تُرجع هذه الدالة إهلاك أصول لفترة معينة باستخدام أسلوب الرصيد المتناقص الثابت.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/db-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. التكلفة الأولية للأصول.' },
            salvage: { name: 'salvage', detail: 'مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول).' },
            life: { name: 'life', detail: 'مطلوب. عدد الفترات التي يتم فيها إهلاك الأصل (تسمى أحياناً العمر الإنتاجي للأصل).' },
            period: { name: 'period', detail: 'مطلوب. الفترة التي تريد حساب الإهلاك فيها. يجب أن تستخدم الوسيطة Period الوحدات نفسها التي تستخدمها الوسيطة life.' },
            month: { name: 'month', detail: 'الاختياري. عدد الأشهر في السنة الأولى. في حال حذف الوسيطة month، يفترض أنها تساوي 12.' },
        },
    },
    DDB: {
        description: 'تُرجع هذه الدالة إهلاك الأصول لفترة معينة باستخدام طريقة الرصيد المتناقص المزدوج أو طريقة أخرى تحددها.',
        abstract: 'تُرجع هذه الدالة إهلاك الأصول لفترة معينة باستخدام طريقة الرصيد المتناقص المزدوج أو طريقة أخرى تحددها.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ddb-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. التكلفة الأولية للأصول.' },
            salvage: { name: 'salvage', detail: 'مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول). قد تكون هذه القيمة 0.' },
            life: { name: 'life', detail: 'مطلوب. عدد الفترات التي يتم فيها إهلاك الأصل (تسمى أحياناً العمر الإنتاجي للأصل).' },
            period: { name: 'period', detail: 'مطلوب. الفترة التي تريد حساب الإهلاك فيها. يجب أن تستخدم الوسيطة Period الوحدات نفسها التي تستخدمها الوسيطة life.' },
            factor: { name: 'factor', detail: 'الاختياري. المعدل الذي تتراجع عنده الميزانية. إذا تم حذف الوسيطة factor، فسيفترض أنها 2 (أسلوب الاستهلاك المتناقص المزدوج).' },
        },
    },
    DISC: {
        description: 'تُرجع هذه الدالة معدل الخصم لورقة المالية.',
        abstract: 'تُرجع هذه الدالة معدل الخصم لورقة المالية.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/disc-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    DOLLARDE: {
        description: 'تحوّل هذه الدالة سعر دولار يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مثل 1.02، إلى سعر دولار يتم التعبير عنه كرقم عشري. تُستخدم أرقام الدولار الكسرية أحياناً في أسعار الأوراق المالية.',
        abstract: 'تحوّل هذه الدالة سعر دولار يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مثل 1.02، إلى سعر دولار يتم التعبير عنه كرقم عشري. تُستخدم أرقام الدولار الكسرية أحياناً في أسعار الأوراق المالية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dollarde-function',
            },
        ],
        functionParameter: {
            fractionalDollar: { name: 'fractional_dollar', detail: 'مطلوب. رقم يتم التعبير عنه كجزء من عدد صحيح وجزء كسر، مفصول برمز عشري.' },
            fraction: { name: 'fraction', detail: 'مطلوب. العدد الصحيح الذي تريد استخدامه في مقام الكسر.' },
        },
    },
    DOLLARFR: {
        description: 'استخدم DOLLARFR لتحويل أرقام عشرية إلى أرقام دولار عشرية، مثل أسعار الأوراق المالية.',
        abstract: 'استخدم DOLLARFR لتحويل أرقام عشرية إلى أرقام دولار عشرية، مثل أسعار الأوراق المالية.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dollarfr-function',
            },
        ],
        functionParameter: {
            decimalDollar: { name: 'decimal_dollar', detail: 'مطلوب. رقم عشري.' },
            fraction: { name: 'fraction', detail: 'مطلوب. العدد الصحيح المستخدم في مقام الكسر.' },
        },
    },
    DURATION: {
        description: 'ترجع الدالة DURATION ، إحدى الدالات المالية ، مدة ماكاوولي لقيمة مفترضة من نفس القيمة تبلغ 100 دولار. وتعرف المدة كمتوسط مرجح للقيمة الحالية للتدفقات النقدية، وتستخدم كمقياس لاستجابة سعر السند للتغيرات في العائد.',
        abstract: 'ترجع الدالة DURATION ، إحدى الدالات المالية ، مدة ماكاوولي لقيمة مفترضة من نفس القيمة تبلغ 100 دولار. وتعرف المدة كمتوسط مرجح للقيمة الحالية للتدفقات النقدية، وتستخدم كمقياس لاستجابة سعر السند للتغيرات في العائد.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/duration-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            coupon: { name: 'coupon', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            yld: { name: 'yld', detail: 'مطلوب. العائد السنوي للورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    EFFECT: {
        description: 'تُرجع معدل الفائدة السنوي الساري المفعول، بالنظر إلى معدل الفائدة السنوي الاسمي وعدد الفترات المتراكبة في السنة.',
        abstract: 'تُرجع معدل الفائدة السنوي الساري المفعول، بالنظر إلى معدل الفائدة السنوي الاسمي وعدد الفترات المتراكبة في السنة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/effect-function',
            },
        ],
        functionParameter: {
            nominalRate: { name: 'nominal_rate', detail: 'مطلوب. معدل الفائدة الاسمي.' },
            npery: { name: 'npery', detail: 'مطلوب. عدد الفترات المتراكبة كل سنة.' },
        },
    },
    FV: {
        description: 'تحسب الدالة FV ، وهي إحدى الدالات المالية ، القيمة المستقبلية للاستثمار استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام FV مع إما الدفعات الدورية الثابتة أو دفعة واحدة من المبلغ الإجمالي.',
        abstract: 'تحسب الدالة FV ، وهي إحدى الدالات المالية ، القيمة المستقبلية للاستثمار استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام FV مع إما الدفعات الدورية الثابتة أو دفعة واحدة من المبلغ الإجمالي.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/fv-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة لكل فترة زمنية.' },
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري.' },
            pmt: { name: 'pmt', detail: 'مطلوب. الدفعة التي تم سدادها في كل فترة؛ لا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. إذا تم حذف pmt، فيجب تضمين الوسيطة pv.' },
            pv: { name: 'pv', detail: 'الاختياري. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي. إذا تم حذف pv، فسيتم افتراض أنها 0 (صفر)، وعليك تضمين الوسيطة pmt.' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات. إذا تم حذف الوسيطة type، فسيتم افتراض أنها 0.' },
        },
    },
    FVSCHEDULE: {
        description: 'تُرجع القيمة المستقبلية لرأس مال أولي بعد تطبيق سلسلة من معدلات الفائدة المركبة. استخدم FVSCHEDULE لحساب القيمة المستقبلية لاستثمار بمعدل متغير أو قابل للتعديل.',
        abstract: 'تُرجع القيمة المستقبلية لرأس مال أولي بعد تطبيق سلسلة من معدلات الفائدة المركبة. استخدم FVSCHEDULE لحساب القيمة المستقبلية لاستثمار بمعدل متغير أو قابل للتعديل.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/fvschedule-function',
            },
        ],
        functionParameter: {
            principal: { name: 'principal', detail: 'مطلوب. القيمة الحالية.' },
            schedule: { name: 'schedule', detail: 'مطلوب. صفيف معدلات الفائدة التي تريد تطبيقها.' },
        },
    },
    INTRATE: {
        description: 'تُرجع هذه الدالة معدل الفائدة لورقة مالية تم استثمارها بالكامل.',
        abstract: 'تُرجع هذه الدالة معدل الفائدة لورقة مالية تم استثمارها بالكامل.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/intrate-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            investment: { name: 'investment', detail: 'مطلوب. المبلغ المستثمر في الورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. المبلغ المستلم عند الاستحقاق.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    IPMT: {
        description: 'تُرجع هذه الدالة دفعة الفائدة لفترة استثمار محددة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.',
        abstract: 'تُرجع هذه الدالة دفعة الفائدة لفترة استثمار محددة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ipmt-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة لكل فترة زمنية.' },
            per: { name: 'per', detail: 'مطلوب. الفترة التي تريد البحث عن الفائدة الخاصة بها ويجب أن تكون في النطاق من 1 إلى nper.' },
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0).' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات. إذا تم حذف الوسيطة type، فسيتم افتراض أنها 0.' },
        },
    },
    IRR: {
        description: 'تُرجع هذه الدالة نسبة العائد الداخلي لسلسلة التدفقات النقدية الممثلة بواسطة الأرقام في القيم. من غير الضروري أن تكون هذه التدفقات النقدية متساوية، كما هي في المرتب الدوري. ومع ذلك، يجب أن تحدث التدفقات النقدية على فترات زمنية منتظمة، شهرية أو سنوية مثلاً. إن نسبة العائد الداخلي هي معدل الفائدة التي يتم استلامها لاستثمار يتألف من دفعات (قيم سالبة) وإيرادات (قيم موجبة) تحدث على فترات منتظمة.',
        abstract: 'تُرجع هذه الدالة نسبة العائد الداخلي لسلسلة التدفقات النقدية الممثلة بواسطة الأرقام في القيم. من غير الضروري أن تكون هذه التدفقات النقدية متساوية، كما هي في المرتب الدوري. ومع ذلك، يجب أن تحدث التدفقات النقدية على فترات زمنية منتظمة، شهرية أو سنوية مثلاً. إن نسبة العائد الداخلي هي معدل الفائدة التي يتم استلامها لاستثمار يتألف من دفعات (قيم سالبة) وإيرادات (قيم موجبة) تحدث على فترات منتظمة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/irr-function',
            },
        ],
        functionParameter: {
            values: { name: 'values', detail: 'صفيف أو مرجع إلى خلايا تحتوي على أرقام تريد حساب معدل العائد الداخلي لها.\n1. يجب أن تحتوي values على قيمة موجبة واحدة وقيمة سالبة واحدة على الأقل لحساب معدل العائد الداخلي.\n2. تستخدم IRR ترتيب القيم لتفسير ترتيب التدفقات النقدية؛ أدخل قيم الدفعات والإيرادات بالتسلسل الذي تريده.\n3. إذا احتوت وسيطة صفيف أو مرجع على نص أو قيم منطقية أو خلايا فارغة، فتُتجاهل تلك القيم.' },
            guess: { name: 'guess', detail: 'رقم تخمّن أنه قريب من نتيجة IRR.' },
        },
    },
    ISPMT: {
        description: 'حساب الفائدة المدفوعة (أو المستلمة) للفترة المحددة للقرض (أو الاستثمار) مع حتى المدفوعات الرئيسية.',
        abstract: 'حساب الفائدة المدفوعة (أو المستلمة) للفترة المحددة للقرض (أو الاستثمار) مع حتى المدفوعات الرئيسية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ispmt-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوبة. معدل الفائدة للاستثمار.' },
            per: { name: 'per', detail: 'مطلوبة. الفترة التي تريد العثور على الفائدة لها، ويجب أن تكون بين 1 وNper.' },
            nper: { name: 'nper', detail: 'مطلوبة. العدد الإجمالي لفترات الدفع للاستثمار.' },
            pv: { name: 'pv', detail: 'مطلوبة. القيمة الحالية للاستثمار. بالنسبة للقرض، Pv هو مبلغ القرض.' },
        },
    },
    MDURATION: {
        description: 'تُرجع هذه الدالة الفترة الزمنية المعدلة لماكولي لورقة مالية لها سعر تعادل افتراضي يساوي 100 ر.س..',
        abstract: 'تُرجع هذه الدالة الفترة الزمنية المعدلة لماكولي لورقة مالية لها سعر تعادل افتراضي يساوي 100 ر.س..',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/mduration-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            coupon: { name: 'coupon', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            yld: { name: 'yld', detail: 'مطلوب. العائد السنوي للورقة المالية.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    MIRR: {
        description: 'تُرجع هذه الدالة نسبة العائد الداخلي المعدّلة لسلسلة من التدفقات النقدية الدورية. تأخذ MIRR في الاعتبار كلاً من تكلفة الاستثمار والفائدة المستلمة عند إعادة استثمار النقد.',
        abstract: 'تُرجع هذه الدالة نسبة العائد الداخلي المعدّلة لسلسلة من التدفقات النقدية الدورية. تأخذ MIRR في الاعتبار كلاً من تكلفة الاستثمار والفائدة المستلمة عند إعادة استثمار النقد.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/mirr-function',
            },
        ],
        functionParameter: {
            values: { name: 'values', detail: 'مطلوب. صفيف أو مرجع إلى خلايا تحتوي على أرقام. تمثل هذه الأرقام سلسلة من الدفعات (قيم سالبة) والإيرادات (قيم موجبة) التي تحدث على فترات منتظمة. يجب أن تحتوي القيم على قيمة موجبة واحدة على الأقل وقيمة سالبة واحدة لحساب معدل العائد الداخلي المعدل. وإلا، فترجع الدالة MIRR #DIV/0! وهي قيمة خطأ. إذا احتوت وسيطة صفيف أو مرجع على نص أو قيم منطقية أو خلايا فارغة، فيتم تجاهل تلك القيم؛ وبالرغم من ذلك، يتم تضمين الخلايا التي تحتوي على قيمة الصفر (0).' },
            financeRate: { name: 'finance_rate', detail: 'مطلوب. نسبة الفائدة التي تدفعها على النقود المستخدمة في التدفقات النقدية.' },
            reinvestRate: { name: 'reinvest_rate', detail: 'مطلوب. نسبة الفائدة التي تتلقاها على التدفقات النقدية عند إعادة استثمارها.' },
        },
    },
    NOMINAL: {
        description: 'تُرجع هذه الدالة النسبة الاسمية السنوية للفائدة وفقاً لنسبة الفائدة الفعلية وعدد الفترات المتراكبة كل سنة.',
        abstract: 'تُرجع هذه الدالة النسبة الاسمية السنوية للفائدة وفقاً لنسبة الفائدة الفعلية وعدد الفترات المتراكبة كل سنة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/nominal-function',
            },
        ],
        functionParameter: {
            effectRate: { name: 'effect_rate', detail: 'مطلوب. نسبة الفائدة الفعلية.' },
            npery: { name: 'npery', detail: 'مطلوب. عدد الفترات المتراكبة كل سنة.' },
        },
    },
    NPER: {
        description: 'تُرجع هذه الدالة عدد فترات الاستثمار استناداً إلى دفعات ثابتة دورية ومعدل فائدة ثابت.',
        abstract: 'تُرجع هذه الدالة عدد فترات الاستثمار استناداً إلى دفعات ثابتة دورية ومعدل فائدة ثابت.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/nper-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة لكل فترة زمنية.' },
            pmt: { name: 'pmt', detail: 'مطلوب. الدفعة التي تم سدادها في كل فترة؛ لا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية، أو مقدار المبلغ الإجمالي الذي تساويه سلسلة دفعات مستقبلية في الوقت الحالي.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0).' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات.' },
        },
    },
    NPV: {
        description: 'تحسب هذه الدالة القيمة الحالية الصافية للاستثمار باستخدام معدل الخصم وسلسلة من الدفعات المستقبلية (قيم سالبة) والإيرادات (قيم موجبة).',
        abstract: 'تحسب هذه الدالة القيمة الحالية الصافية للاستثمار باستخدام معدل الخصم وسلسلة من الدفعات المستقبلية (قيم سالبة) والإيرادات (قيم موجبة).',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/npv-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الخصم على مدار طول فترة واحدة.' },
            value1: { name: 'value1', detail: 'Value1 مطلوب، والقيم اللاحقة اختيارية. تمثل الوسيطات من 1 إلى 254 الدفعات والإيرادات. يجب أن تكون Value1, value2, ...‎ على فترات متساوية من الوقت وأن تحدث في نهاية كل فترة. تستخدم الدالة NPV ترتيب value1, value2,...‎ لتفسير ترتيب التدفقات النقدية. تأكد من إدخال قيم الدفعات والإيرادات بالتسلسل الصحيح. سيتم تجاهل الوسيطات إذا كانت عبارة عن خلايا فارغة أو قيم منطقية أو تمثيلات نصية للأرقام أو قيم خطأ أو نص لا يمكن ترجمته إلى أرقام. إذا كانت الوسيطة عبارة عن صفيف أو مرجع، يتم حساب الأرقام الموجودة في ذلك الصفيف أو المرجع فقط. ويتم تجاهل الخلايا الفارغة أو القيم المنطقية أو النص أو قيم الخطأ في الصفيف أو المرجع.' },
            value2: { name: 'value2', detail: 'Value1 مطلوب، والقيم اللاحقة اختيارية. تمثل الوسيطات من 1 إلى 254 الدفعات والإيرادات. يجب أن تكون Value1, value2, ...‎ على فترات متساوية من الوقت وأن تحدث في نهاية كل فترة. تستخدم الدالة NPV ترتيب value1, value2,...‎ لتفسير ترتيب التدفقات النقدية. تأكد من إدخال قيم الدفعات والإيرادات بالتسلسل الصحيح. سيتم تجاهل الوسيطات إذا كانت عبارة عن خلايا فارغة أو قيم منطقية أو تمثيلات نصية للأرقام أو قيم خطأ أو نص لا يمكن ترجمته إلى أرقام. إذا كانت الوسيطة عبارة عن صفيف أو مرجع، يتم حساب الأرقام الموجودة في ذلك الصفيف أو المرجع فقط. ويتم تجاهل الخلايا الفارغة أو القيم المنطقية أو النص أو قيم الخطأ في الصفيف أو المرجع.' },
        },
    },
    ODDFPRICE: {
        description: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).',
        abstract: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/oddfprice-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            issue: { name: 'issue', detail: 'مطلوب. وهي تاريخ إصدار الورقة المالية.' },
            firstCoupon: { name: 'first_coupon', detail: 'مطلوب. تاريخ القسيمة الأولى للورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. معدل فائدة الورقة المالية.' },
            yld: { name: 'yld', detail: 'مطلوب. العائد السنوي للورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    ODDFYIELD: {
        description: 'تُرجع هذه الدالة عائد ورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).',
        abstract: 'تُرجع هذه الدالة عائد ورقة مالية في الجزء الأول من فترة كلية (قصيرة أو طويلة).',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/oddfyield-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            issue: { name: 'issue', detail: 'مطلوب. وهي تاريخ إصدار الورقة المالية.' },
            firstCoupon: { name: 'first_coupon', detail: 'مطلوب. تاريخ القسيمة الأولى للورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. معدل فائدة الورقة المالية.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    ODDLPRICE: {
        description: 'ترجع السعر لكل قيمة اسمية قدرها 100 دولار لسند ذي فترة أخيرة غير منتظمة.',
        abstract: 'ترجع السعر لكل قيمة اسمية قدرها 100 دولار لسند ذي فترة أخيرة غير منتظمة.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/oddlprice-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'تاريخ تسوية الورقة المالية.' },
            maturity: { name: 'maturity', detail: 'تاريخ استحقاق الورقة المالية.' },
            lastInterest: { name: 'last_interest', detail: 'تاريخ آخر قسيمة للورقة المالية.' },
            rate: { name: 'rate', detail: 'سعر فائدة الورقة المالية.' },
            yld: { name: 'yld', detail: 'العائد السنوي للورقة المالية.' },
            redemption: { name: 'redemption', detail: 'قيمة استرداد الورقة المالية لكل 100 دولار من القيمة الاسمية.' },
            frequency: { name: 'frequency', detail: 'عدد دفعات القسيمة في السنة. للدفعات السنوية يكون frequency = 1، ولنصف السنوية = 2، وللربع سنوية = 4.' },
            basis: { name: 'basis', detail: 'نوع أساس احتساب الأيام المراد استخدامه.' },
        },
    },
    ODDLYIELD: {
        description: 'تُرجع هذه الدالة عائد ورقة مالية في الجزء الأخير من فترة كلية (قصيرة أو طويلة).',
        abstract: 'تُرجع هذه الدالة عائد ورقة مالية في الجزء الأخير من فترة كلية (قصيرة أو طويلة).',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/oddlyield-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            lastInterest: { name: 'last_interest', detail: 'مطلوب. تاريخ القسيمة الأخيرة للورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. معدل فائدة الورقة المالية.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    PDURATION: {
        description: 'تُرجع هذه الدالة عدد الفترات التي يتطلبها استثمار من أجل تحقيق قيمة محددة.',
        abstract: 'تُرجع هذه الدالة عدد الفترات التي يتطلبها استثمار من أجل تحقيق قيمة محددة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/pduration-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. السعر هو معدل الفائدة لكل فترة زمنية.' },
            pv: { name: 'pv', detail: 'مطلوب. Pv هي القيمة الحالية للاستثمار.' },
            fv: { name: 'fv', detail: 'مطلوب. Fv هي القيمة المستقبلية المطلوبة للاستثمار.' },
        },
    },
    PMT: {
        description: 'تحسب الدالة PMT ، وهي إحدى الدالات المالية ، الدفعة لتسديد قرض استناداً إلى الدفعات الثابتة ونسبة فائدة ثابتة.',
        abstract: 'تحسب الدالة PMT ، وهي إحدى الدالات المالية ، الدفعة لتسديد قرض استناداً إلى الدفعات الثابتة ونسبة فائدة ثابتة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/pmt-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة للقرض.' },
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لدفعات تسديد القرض.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن؛ وتُعرف أيضاً برأس المال.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف fv، فسيفترض أنها 0 (صفر)، أي أن القيمة المستقبلية لقرض مثلاً تساوي صفر.' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 (صفر) أو 1 وهي تشير إلى موعد استحقاق الدفعات.' },
        },
    },
    PPMT: {
        description: 'تُرجع الدفعة لرأس المال لفترة استثمار معينة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.',
        abstract: 'تُرجع الدفعة لرأس المال لفترة استثمار معينة استناداً إلى دفعات دورية ثابتة ومعدل فائدة ثابت.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/ppmt-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة لكل فترة زمنية.' },
            per: { name: 'per', detail: 'مطلوب. تحدد الفترة ويجب أن تقع في النطاق بين 1 وقيمة nper.' },
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف fv، فسيفترض أنها 0 (صفر)، أي أن القيمة المستقبلية لقرض مثلاً تساوي صفر.' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات.' },
        },
    },
    PRICE: {
        description: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تستحق عنها فائدة دورية.',
        abstract: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تستحق عنها فائدة دورية.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/price-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            yld: { name: 'yld', detail: 'مطلوب. العائد السنوي للورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    PRICEDISC: {
        description: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية ذات خصم.',
        abstract: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية ذات خصم.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/pricedisc-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            discount: { name: 'discount', detail: 'مطلوب. معدل الخصم على الورقة المالية.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    PRICEMAT: {
        description: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تُدفع فائدتها عند الاستحقاق.',
        abstract: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لورقة مالية تُدفع فائدتها عند الاستحقاق.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/pricemat-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            issue: { name: 'issue', detail: 'مطلوب. تاريخ إصدار الورقة المالية، ويتم التعبير عنه برقم تاريخ تسلسلي.' },
            rate: { name: 'rate', detail: 'مطلوب. معدل فائدة الورقة المالية عند تاريخ الإصدار.' },
            yld: { name: 'yld', detail: 'مطلوب. العائد السنوي للورقة المالية.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    PV: {
        description: 'تحسب الدالة PV ، وهي إحدى الدالات المالية ، القيمة الحالية لقرض أو استثمار، وذلك استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام الدالة PV مع إما الدفعات الدورية الثابتة (مثل رهن أو أي قرض آخر) أو أية قيمة مستقبلية تشكل هدفك الاستثماري.',
        abstract: 'تحسب الدالة PV ، وهي إحدى الدالات المالية ، القيمة الحالية لقرض أو استثمار، وذلك استناداً إلى نسبة فائدة ثابتة. يمكنك استخدام الدالة PV مع إما الدفعات الدورية الثابتة (مثل رهن أو أي قرض آخر) أو أية قيمة مستقبلية تشكل هدفك الاستثماري.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/pv-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الفائدة لكل فترة زمنية. على سبيل المثال، إذا حصلت على قرض لشراء سيارة بمعدل فائدة سنوية 10% وكان عليك تسديد الدفعات شهرياً، فسيكون معدل الفائدة لكل شهر 12/%10 أو %0,83. يمكنك إدخال 12/%10 أو %0,83 أو 0,0083 في الصيغة كمعدل الفائدة.' },
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري. على سبيل المثال، إذا حصلت على قرض مدته 4 سنوات لشراء سيارة وكان عليك تسديد الدفعات شهرياً، فسيكون القرض عبارة عن 4*12 (أو 48) فترة زمنية. وعليك إدخال 48 في الصيغة للوسيطة nper.' },
            pmt: { name: 'pmt', detail: 'مطلوب. الدفعة التي تم تسديدها في كل فترة ولا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي الوسيطة pmt عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. على سبيل المثال، سيكون عليك تسديد دفعات شهرية قيمتها 263,33 ر.س. مقابل قرض قيمته 10000 ر.س. ومدته 4 سنوات لشراء سيارة بمعدل فائدة 12%. يمكنك إدخال -263.33 في الصيغة ك pmt. إذا تم حذف pmt، يجب تضمين الوسيطة fv.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الرصيد النقدي الذي تريد تحقيقه بعد إجراء الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيُفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي 0). على سبيل المثال، إذا كنت تريد ادخار مبلغ 50000 ر.س. لتدفعه لمشروع خاص خلال 18 عاماً، فتكون القيمة المستقبلية 50000 ر.س.. يمكنك حينئذٍ إجراء تخمين متحفظ في ما يتعلق بمعدل الفائدة وتحديد المبلغ الذي يجب أن تدّخره كل شهر. إذا تم حذف الوسيطة fv، فيجب تضمين الوسيطة pmt.' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات.' },
        },
    },
    RATE: {
        description: 'إرجاع معدل الفائدة لكل فترة من فترات المرتب الدوري. يتم حساب RATE من خلال التكرار ويمكن أن يكون لها حلول صفرية أو أكثر. إذا كانت نتائج RATE المتتالية لا تتقارب إلى 0.0000001 بعد 20 مرة، تقوم RATE بإرجاع #NUM! قيمة الخطأ.',
        abstract: 'إرجاع معدل الفائدة لكل فترة من فترات المرتب الدوري. يتم حساب RATE من خلال التكرار ويمكن أن يكون لها حلول صفرية أو أكثر. إذا كانت نتائج RATE المتتالية لا تتقارب إلى 0.0000001 بعد 20 مرة، تقوم RATE بإرجاع #NUM! قيمة الخطأ.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/rate-function',
            },
        ],
        functionParameter: {
            nper: { name: 'nper', detail: 'مطلوب. العدد الإجمالي لفترات الدفعات في المرتب الدوري.' },
            pmt: { name: 'pmt', detail: 'مطلوب. الدفعة التي تم تسديدها في كل فترة ولا يمكن أن تتغير على مدى عمر المرتب الدوري. تحتوي وسيطة الدفعة عادةً على رأس مال وفائدة ولكن بدون رسوم أو ضرائب أخرى. إذا تم حذف الوسيطة pmt، فيجب تضمين الوسيطة fv.' },
            pv: { name: 'pv', detail: 'مطلوب. القيمة الحالية، أو المبلغ الإجمالي الذي تساويه سلسلة الدفعات المستقبلية الآن.' },
            fv: { name: 'fv', detail: 'الاختياري. القيمة المستقبلية أو الميزانية النقدية التي تريد تحقيقها بعد إتمام الدفعة الأخيرة. إذا تم حذف الوسيطة fv، فسيفترض أنها 0 (القيمة المستقبلية لقرض، مثلاً، هي صفر). إذا تم حذف الوسيطة fv، فيجب تضمين الوسيطة pmt.' },
            type: { name: 'type', detail: 'الاختياري. الرقم 0 أو 1 ويشير إلى موعد استحقاق الدفعات.' },
            guess: { name: 'guess', detail: 'الاختياري. تقديرك لقيمة المعدل. إذا تم حذف الوسيطة guess، فسيُفترض أنها 10 بالمئة. إذا لم تتقارب نتائج الدالة RATE، فحاول استخدام قيم مختلفة للوسيطة guess. تتقارب نتائج الدالة RATE عادةً إذا كانت قيمة guess بين 0 و1.' },
        },
    },
    RECEIVED: {
        description: 'تُرجع هذه الدالة المبلغ الذي يتم استلامه عند استحقاق ورقة مالية تم استثمارها بالكامل.',
        abstract: 'تُرجع هذه الدالة المبلغ الذي يتم استلامه عند استحقاق ورقة مالية تم استثمارها بالكامل.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/received-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            investment: { name: 'investment', detail: 'مطلوب. المبلغ المستثمر في الورقة المالية.' },
            discount: { name: 'discount', detail: 'مطلوب. معدل الخصم على الورقة المالية.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    RRI: {
        description: 'تُرجع هذه الدالة معدل فائدة يكون مكافئاً لنمو الاستثمار.',
        abstract: 'تُرجع هذه الدالة معدل فائدة يكون مكافئاً لنمو الاستثمار.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/rri-function',
            },
        ],
        functionParameter: {
            nper: { name: 'nper', detail: 'مطلوب. Nper هو عدد فترات الاستثمار.' },
            pv: { name: 'pv', detail: 'مطلوب. Pv هي القيمة الحالية للاستثمار.' },
            fv: { name: 'fv', detail: 'مطلوب. Fv هي القيمة المستقبلية للاستثمار.' },
        },
    },
    SLN: {
        description: 'تُرجع هذه الدالة الإهلاك بالقسط الثابت لأحد الأصول لفترة واحدة.',
        abstract: 'تُرجع هذه الدالة الإهلاك بالقسط الثابت لأحد الأصول لفترة واحدة.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/sln-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. التكلفة الأولية للأصول.' },
            salvage: { name: 'salvage', detail: 'مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول).' },
            life: { name: 'life', detail: 'مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول).' },
        },
    },
    SYD: {
        description: 'تُرجع هذه الدالة أرقام مجموع سنوات استهلاك أحد الأصول لفترة معيّنة.',
        abstract: 'تُرجع هذه الدالة أرقام مجموع سنوات استهلاك أحد الأصول لفترة معيّنة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/syd-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. التكلفة الأولية للأصول.' },
            salvage: { name: 'salvage', detail: 'مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول).' },
            life: { name: 'life', detail: 'مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول).' },
            per: { name: 'per', detail: 'مطلوب. الفترة ويجب أن تستخدم الوحدات نفسها التي يستخدمها العمر الإنتاجي.' },
        },
    },
    TBILLEQ: {
        description: 'تُرجع هذه الدالة العائد المساوي للسند لإذن الخزانة.',
        abstract: 'تُرجع هذه الدالة العائد المساوي للسند لإذن الخزانة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/tbilleq-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة.' },
            discount: { name: 'discount', detail: 'مطلوب. معدل الخصم على سند إذن الخزانة.' },
        },
    },
    TBILLPRICE: {
        description: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لسند الخزانة.',
        abstract: 'تُرجع هذه الدالة السعر لكل قيمة اسمية قدرها 100 ر.س. لسند الخزانة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/tbillprice-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة.' },
            discount: { name: 'discount', detail: 'مطلوب. معدل الخصم على سند إذن الخزانة.' },
        },
    },
    TBILLYIELD: {
        description: 'تُرجع هذه الدالة العائد الخاص بإذن الخزانة.',
        abstract: 'تُرجع هذه الدالة العائد الخاص بإذن الخزانة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/tbillyield-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. تاريخ تسوية سند إذن الخزانة. تاريخ تسوية الورقة المالية هو التاريخ الذي يعقب تاريخ الإصدار عند منح سند إذن الخزانة للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. تاريخ استحقاق سند إذن الخزانة. تاريخ الاستحقاق هو تاريخ انتهاء سند إذن الخزانة.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر سند إذن الخزانة لكل قيمة اسمية قدرها 100 ر.س.' },
        },
    },
    VDB: {
        description: 'تُرجع هذه الدالة استهلاك أحد الأصول لأي فترة تحددها، بما فيها الفترات الجزئية، باستخدام أسلوب الرصيد المتناقص المزدوج أو أسلوب آخر تحدده. ترمز VDB إلى الرصيد المتناقص المتغير.',
        abstract: 'تُرجع هذه الدالة استهلاك أحد الأصول لأي فترة تحددها، بما فيها الفترات الجزئية، باستخدام أسلوب الرصيد المتناقص المزدوج أو أسلوب آخر تحدده. ترمز VDB إلى الرصيد المتناقص المتغير.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/vdb-function',
            },
        ],
        functionParameter: {
            cost: { name: 'cost', detail: 'مطلوب. التكلفة الأولية للأصول.' },
            salvage: { name: 'salvage', detail: 'مطلوب. القيمة عند نهاية الإهلاك (وتسمى في بعض الأحيان القيمة الباقية للأصول). قد تكون هذه القيمة 0.' },
            life: { name: 'life', detail: 'مطلوب. عدد الفترات التي يتم فيها إهلاك الأصول (تسمى أحياناً فترة الانتفاع من الأصول).' },
            startPeriod: { name: 'start_period', detail: 'مطلوب. الفترة التي تريد منها بدء حساب الإهلاك. يجب أن تستخدم Start_period الوحدات نفسها التي يستخدمها العمر الإنتاجي.' },
            endPeriod: { name: 'end_period', detail: 'مطلوب. الفترة التي تريد عندها إنهاء حساب الإهلاك. يجب أن تستخدم End_period الوحدات نفسها التي يستخدمها العمر الإنتاجي.' },
            factor: { name: 'factor', detail: 'الاختياري. المعدل الذي تتراجع عنده الميزانية. إذا تم حذف العامل، فسيتم افتراض أنه 2 (أسلوب الرصيد المتناقص المزدوج). غيّر العامل إذا كنت لا تريد استخدام أسلوب الرصيد المتناقص المزدوج. للحصول على وصف لأسلوب الرصيد المتناقص المزدوج، راجع DDB.' },
            noSwitch: { name: 'no_switch', detail: 'الاختياري. قيمة منطقية تحدد إذا ما كان سيتم التبديل إلى الإهلاك الثابت عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص. إذا كانت قيمة no_switch تساوي TRUE، لا يبدل Microsoft Excel إلى الإهلاك الثابت للموجودات حتى عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص. إذا كانت قيمة no_switch تساوي FALSE أو محذوفة، يبدل Excel إلى الإهلاك الثابت للموجودات عندما يكون الإهلاك أكبر من حساب الرصيد المتناقص.' },
        },
    },
    XIRR: {
        description: 'تُرجع معدل العائد الداخلي لجدول تدفقات نقدية ليست بالضرورة دورية. لحساب معدل العائد الداخلي لسلسلة من التدفقات النقدية الدورية، استخدم الدالة IRR.',
        abstract: 'تُرجع معدل العائد الداخلي لجدول تدفقات نقدية ليست بالضرورة دورية. لحساب معدل العائد الداخلي لسلسلة من التدفقات النقدية الدورية، استخدم الدالة IRR.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/xirr-function',
            },
        ],
        functionParameter: {
            values: { name: 'values', detail: 'مطلوب. سلسلة من التدفقات النقدية التي تطابق جدول دفعات من حيث التواريخ. إن الدفعة الأولى اختيارية وتتطابق مع تكلفة أو دفعة تحدث عند بداية الاستثمار. إذا كانت القيمة الأولى تكلفة أو دفعة، فيجب أن تكون قيمة سالبة. يتم تطبيق خصم على كافة الدفعات التالية على أساس سنة مؤلفة من 365 يوماً. يجب أن تحتوي سلسلة القيم على قيمة واحدة موجبة وأخرى سالبة على الأقل.' },
            dates: { name: 'dates', detail: 'مطلوب. جدول بتواريخ الدفعات مطابق لدفعات التدفقات النقدية. قد تحدث التواريخ بأي ترتيب. يجب إدخال التواريخ باستخدام الدالة DATE، أو كنتائج لصيغ أو دالات أخرى. على سبيل المثال، استخدم DATE(2008,5,23)‎ لليوم الثالث والعشرين من شهر مايو 2008. قد تحدث بعض المشاكل إذا تم إدخال التواريخ كنص. .' },
            guess: { name: 'guess', detail: 'الاختياري. رقم تقدّر أنه قريب من نتيجة الدالة XIRR.' },
        },
    },
    XNPV: {
        description: 'تُرجع القيمة الحالية الصافية لجدول زمني من التدفقات النقدية لا يكون بالضرورة دورياً. لحساب القيمة الحالية الصافية لسلسلة من التدفقات النقدية الدورية، استخدم الدالة NPV.',
        abstract: 'تُرجع القيمة الحالية الصافية لجدول زمني من التدفقات النقدية لا يكون بالضرورة دورياً. لحساب القيمة الحالية الصافية لسلسلة من التدفقات النقدية الدورية، استخدم الدالة NPV.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/xnpv-function',
            },
        ],
        functionParameter: {
            rate: { name: 'rate', detail: 'مطلوب. معدل الخصم الذي تريد تطبيقه على التدفقات النقدية.' },
            values: { name: 'values', detail: 'مطلوب. سلسلة من التدفقات النقدية التي تطابق جدول دفعات من حيث التواريخ. إن الدفعة الأولى اختيارية وتتطابق مع تكلفة أو دفعة تحدث عند بداية الاستثمار. إذا كانت القيمة الأولى تكلفة أو دفعة، فيجب أن تكون قيمة سالبة. يتم تطبيق خصم على كافة الدفعات التالية على أساس سنة مؤلفة من 365 يوماً. يجب أن تحتوي سلسلة القيم على قيمة موجبة وأخرى سالبة على الأقل.' },
            dates: { name: 'dates', detail: 'مطلوب. جدول بتواريخ الدفعات مطابق لدفعات التدفقات النقدية. يشير تاريخ الدفعة الأولى إلى بداية جدول الدفعات. أما التواريخ الأخرى فيجب أن تقع بعد هذا التاريخ، ولكن قد تحدث بأي ترتيب.' },
        },
    },
    YIELD: {
        description: 'تُرجع هذه الدالة عائد ورقة مالية تستحق عنها فائدة دورية. استخدم YIELD لحساب عائد السند.',
        abstract: 'تُرجع هذه الدالة عائد ورقة مالية تستحق عنها فائدة دورية. استخدم YIELD لحساب عائد السند.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/yield-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            rate: { name: 'rate', detail: 'مطلوب. وهي السعر السنوي لفائدة القسيمة الخاصة بالورقة المالية.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            frequency: { name: 'frequency', detail: 'مطلوب. وهي عدد مدفوعات القسيمة في السنة. بالنسبة إلى المدفوعات السنوية، frequency = 1؛ والمدفوعات نصف السنوية، frequency = 2؛ والمدفوعات ربع السنوية، frequency = 4.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    YIELDDISC: {
        description: 'تُرجع العائد السنوي لورقة مالية ذات خصم.',
        abstract: 'تُرجع العائد السنوي لورقة مالية ذات خصم.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/yielddisc-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            redemption: { name: 'redemption', detail: 'مطلوب. قيمة استرداد الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
    YIELDMAT: {
        description: 'تُرجع العائد السنوي لأوراق مالية تُدفع فائدتها في تاريخ الاستحقاق.',
        abstract: 'تُرجع العائد السنوي لأوراق مالية تُدفع فائدتها في تاريخ الاستحقاق.',
        links: [
            {
                title: 'Instruction',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/yieldmat-function',
            },
        ],
        functionParameter: {
            settlement: { name: 'settlement', detail: 'مطلوب. وهي تاريخ تسوية الورقة المالية. يمثل تاريخ تسوية الورقة المالية التاريخ الذي يعقب تاريخ الإصدار عند منح الورقة المالية للمشتري.' },
            maturity: { name: 'maturity', detail: 'مطلوب. وهي تاريخ استحقاق الورقة المالية. يمثل تاريخ الاستحقاق تاريخ انتهاء صلاحية الورقة المالية.' },
            issue: { name: 'issue', detail: 'مطلوب. تاريخ إصدار الورقة المالية، ويتم التعبير عنه برقم تاريخ تسلسلي.' },
            rate: { name: 'rate', detail: 'مطلوب. معدل فائدة الورقة المالية عند تاريخ الإصدار.' },
            pr: { name: 'pr', detail: 'مطلوب. سعر الورقة المالية لكل قيمة اسمية قدرها 100 ر.س.' },
            basis: { name: 'basis', detail: 'الاختياري. وهي نوع أساس حساب عدد الأيام المطلوب استخدامه.' },
        },
    },
};

export default locale;
