/**
 * Copyright 2023-present DreamNum Co., Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

import type enUS from './en-US';

const locale: typeof enUS = {
    DAVERAGE: {
        description: 'تحسب هذه الدالة متوسط القيم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تحسب هذه الدالة متوسط القيم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/daverage-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'هي نطاق الخلايا التي تشكل القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'يشير الحقل إلى العمود المستخدم في الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'هي نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DCOUNT: {
        description: 'تقوم هذه الدالة بتعداد الخلايا التي تحتوي على أرقام في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تقوم هذه الدالة بتعداد الخلايا التي تحتوي على أرقام في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dcount-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DCOUNTA: {
        description: 'تقوم هذه الدالة بتعداد الخلايا غير الفارغة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تقوم هذه الدالة بتعداد الخلايا غير الفارغة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dcounta-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'الاختياري. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DGET: {
        description: 'تستخرج هذه الدالة قيمة مفردة من أحد الأعمدة في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تستخرج هذه الدالة قيمة مفردة من أحد الأعمدة في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dget-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DMAX: {
        description: 'تُرجع هذه الدالة أكبر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تُرجع هذه الدالة أكبر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dmax-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DMIN: {
        description: 'تُرجع هذه الدالة أصغر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تُرجع هذه الدالة أصغر رقم في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dmin-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DPRODUCT: {
        description: 'تضرب هذه الدالة القيم الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        abstract: 'تضرب هذه الدالة القيم الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dproduct-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DSTDEV: {
        description: 'تقدّر هذه الدالة الانحراف المعياري لمحتوى استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        abstract: 'تقدّر هذه الدالة الانحراف المعياري لمحتوى استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dstdev-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DSTDEVP: {
        description: 'تحسب هذه الدالة الانحراف المعياري لمحتوى استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        abstract: 'تحسب هذه الدالة الانحراف المعياري لمحتوى استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dstdevp-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DSUM: {
        description: 'في قائمة أو قاعدة بيانات، يوفر DSUM مجموع الأرقام في الحقول (الأعمدة) من السجلات التي تطابق الشروط المحددة.',
        abstract: 'في قائمة أو قاعدة بيانات، يوفر DSUM مجموع الأرقام في الحقول (الأعمدة) من السجلات التي تطابق الشروط المحددة.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dsum-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. هذا هو نطاق الخلايا الذي يشكل القائمة أو قاعدة البيانات. قاعدة البيانات هي قائمة بالبيانات ذات الصلة التي تكون فيها صفوف المعلومات ذات الصلة عبارة عن سجلات ، وأعمدة البيانات هي حقول . يحتوي الصف الأول من القائمة على تسميات لكل عمود فيه.' },
            field: { name: 'field', detail: 'مطلوب. يحدد هذا العمود المستخدم في الدالة. حدد تسمية العمود المضمنة بين علامات الاقتباس المزدوجة، مثل "العمر" أو "العائد"، على سبيل المثال. بدلا من ذلك، يمكنك تحديد رقم (بدون علامات اقتباس) يمثل موضع العمود داخل القائمة: على سبيل المثال، 1 للعمود الأول، و2 للعمود الثاني، وما إلى ذلك.' },
            criteria: { name: 'criteria', detail: 'مطلوب. هذا هو نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DVAR: {
        description: 'تقدّر هذه الدالة تباين محتوىً استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        abstract: 'تقدّر هذه الدالة تباين محتوىً استناداً إلى عينة باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dvar-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
    DVARP: {
        description: 'تحسب هذه الدالة تباين محتوىً استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        abstract: 'تحسب هذه الدالة تباين محتوىً استناداً إلى المحتوى بالكامل باستخدام الأرقام الموجودة في حقل (عمود) من السجلات في قائمة أو قاعدة بيانات والتي تتوافق مع الشروط التي تحددها.',
        links: [
            {
                title: 'التعليمات',
                url: 'https://support.microsoft.com/ar-sa/excel/functions/dvarp-function',
            },
        ],
        functionParameter: {
            database: { name: 'database', detail: 'مطلوب. نطاق الخلايا الذي تتألف منه القائمة أو قاعدة البيانات. إن قاعدة البيانات عبارة عن قائمة من البيانات المرتبطة تمثل فيها صفوف المعلومات المرتبطة السجلات، وتمثل أعمدة البيانات الحقول. يحتوي الصف الأول من القائمة على تسميات لكل عمود.' },
            field: { name: 'field', detail: 'مطلوب. تشير إلى العمود الذي تستخدمه الدالة. قم بإدخال تسمية العمود مع تضمينها بين علامتي اقتباس مزدوجتين، مثل "العمر" أو "المحصول"، أو رقم (بدون علامات اقتباس) يمثل موضع العمود في القائمة: 1 للعمود الأول، و2 للعمود الثاني، وهكذا.' },
            criteria: { name: 'criteria', detail: 'مطلوب. نطاق الخلايا الذي يحتوي على الشروط التي تحددها. يمكنك استخدام أي نطاق لوسيطة المعايير، طالما أن الوسيطة تحتوي على تسمية عمود واحد على الأقل وخلية واحدة على الأقل أسفل تسمية العمود لتحديد شرط للعمود.' },
        },
    },
};

export default locale;
